susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2022-12-19T23:52:17.344859
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CEC_PA15_ PA15,GPIO_AF4
#define CEC_PB6_ PB6,GPIO_AF5
#define _CEC_PA15_ 1
#define _CEC_PB6_ 1

#define DCMI_D0_PA9_ PA9,GPIO_AF13
#define DCMI_D0_PC6_ PC6,GPIO_AF13
#define DCMI_D0_PH9_ PH9,GPIO_AF13
#define _DCMI_D0_PA9_ 1
#define _DCMI_D0_PC6_ 1
#define _DCMI_D0_PH9_ 1

#define DCMI_D1_PA10_ PA10,GPIO_AF13
#define DCMI_D1_PC7_ PC7,GPIO_AF13
#define DCMI_D1_PH10_ PH10,GPIO_AF13
#define _DCMI_D1_PA10_ 1
#define _DCMI_D1_PC7_ 1
#define _DCMI_D1_PH10_ 1

#define DCMI_D10_PB5_ PB5,GPIO_AF13
#define DCMI_D10_PD6_ PD6,GPIO_AF13
#define DCMI_D10_PI3_ PI3,GPIO_AF13
#define _DCMI_D10_PB5_ 1
#define _DCMI_D10_PD6_ 1
#define _DCMI_D10_PI3_ 1

#define DCMI_D11_PD2_ PD2,GPIO_AF13
#define DCMI_D11_PF10_ PF10,GPIO_AF13
#define DCMI_D11_PH15_ PH15,GPIO_AF13
#define _DCMI_D11_PD2_ 1
#define _DCMI_D11_PF10_ 1
#define _DCMI_D11_PH15_ 1

#define DCMI_D12_PF11_ PF11,GPIO_AF13
#define DCMI_D12_PG6_ PG6,GPIO_AF13
#define _DCMI_D12_PF11_ 1
#define _DCMI_D12_PG6_ 1

#define DCMI_D13_PG15_ PG15,GPIO_AF13
#define DCMI_D13_PG7_ PG7,GPIO_AF13
#define DCMI_D13_PI0_ PI0,GPIO_AF13
#define _DCMI_D13_PG15_ 1
#define _DCMI_D13_PG7_ 1
#define _DCMI_D13_PI0_ 1

#define DCMI_D2_PC8_ PC8,GPIO_AF13
#define DCMI_D2_PE0_ PE0,GPIO_AF13
#define DCMI_D2_PG10_ PG10,GPIO_AF13
#define DCMI_D2_PH11_ PH11,GPIO_AF13
#define _DCMI_D2_PC8_ 1
#define _DCMI_D2_PE0_ 1
#define _DCMI_D2_PG10_ 1
#define _DCMI_D2_PH11_ 1

#define DCMI_D3_PC9_ PC9,GPIO_AF13
#define DCMI_D3_PE1_ PE1,GPIO_AF13
#define DCMI_D3_PG11_ PG11,GPIO_AF13
#define DCMI_D3_PH12_ PH12,GPIO_AF13
#define _DCMI_D3_PC9_ 1
#define _DCMI_D3_PE1_ 1
#define _DCMI_D3_PG11_ 1
#define _DCMI_D3_PH12_ 1

#define DCMI_D4_PC11_ PC11,GPIO_AF13
#define DCMI_D4_PE11_ PE11,GPIO_AF13
#define DCMI_D4_PE4_ PE4,GPIO_AF13
#define DCMI_D4_PH14_ PH14,GPIO_AF13
#define _DCMI_D4_PC11_ 1
#define _DCMI_D4_PE11_ 1
#define _DCMI_D4_PE4_ 1
#define _DCMI_D4_PH14_ 1

#define DCMI_D5_PB6_ PB6,GPIO_AF13
#define DCMI_D5_PD3_ PD3,GPIO_AF13
#define DCMI_D5_PI4_ PI4,GPIO_AF13
#define _DCMI_D5_PB6_ 1
#define _DCMI_D5_PD3_ 1
#define _DCMI_D5_PI4_ 1

#define DCMI_D6_PB8_ PB8,GPIO_AF13
#define DCMI_D6_PE13_ PE13,GPIO_AF13
#define DCMI_D6_PE5_ PE5,GPIO_AF13
#define DCMI_D6_PI6_ PI6,GPIO_AF13
#define _DCMI_D6_PB8_ 1
#define _DCMI_D6_PE13_ 1
#define _DCMI_D6_PE5_ 1
#define _DCMI_D6_PI6_ 1

#define DCMI_D7_PB9_ PB9,GPIO_AF13
#define DCMI_D7_PE6_ PE6,GPIO_AF13
#define DCMI_D7_PI7_ PI7,GPIO_AF13
#define _DCMI_D7_PB9_ 1
#define _DCMI_D7_PE6_ 1
#define _DCMI_D7_PI7_ 1

#define DCMI_D8_PC10_ PC10,GPIO_AF13
#define DCMI_D8_PH6_ PH6,GPIO_AF13
#define DCMI_D8_PI1_ PI1,GPIO_AF13
#define _DCMI_D8_PC10_ 1
#define _DCMI_D8_PH6_ 1
#define _DCMI_D8_PI1_ 1

#define DCMI_D9_PC12_ PC12,GPIO_AF13
#define DCMI_D9_PH7_ PH7,GPIO_AF13
#define DCMI_D9_PI2_ PI2,GPIO_AF13
#define _DCMI_D9_PC12_ 1
#define _DCMI_D9_PH7_ 1
#define _DCMI_D9_PI2_ 1

#define DCMI_HSYNC_PA4_ PA4,GPIO_AF13
#define DCMI_HSYNC_PD9_ PD9,GPIO_AF13
#define DCMI_HSYNC_PH8_ PH8,GPIO_AF13
#define _DCMI_HSYNC_PA4_ 1
#define _DCMI_HSYNC_PD9_ 1
#define _DCMI_HSYNC_PH8_ 1

#define DCMI_PIXCLK_PA6_ PA6,GPIO_AF13
#define DCMI_PIXCLK_PC2_ PC2,GPIO_AF13
#define _DCMI_PIXCLK_PA6_ 1
#define _DCMI_PIXCLK_PC2_ 1

#define DCMI_VSYNC_PB7_ PB7,GPIO_AF13
#define DCMI_VSYNC_PG9_ PG9,GPIO_AF13
#define DCMI_VSYNC_PI5_ PI5,GPIO_AF13
#define _DCMI_VSYNC_PB7_ 1
#define _DCMI_VSYNC_PG9_ 1
#define _DCMI_VSYNC_PI5_ 1

#define DEBUG_DBTRGI_PA13_ PA13,GPIO_AF1
#define DEBUG_DBTRGI_PA14_ PA14,GPIO_AF1
#define DEBUG_DBTRGI_PA15_ PA15,GPIO_AF0
#define _DEBUG_DBTRGI_PA13_ 1
#define _DEBUG_DBTRGI_PA14_ 1
#define _DEBUG_DBTRGI_PA15_ 1

#define DEBUG_DBTRGO_PA13_ PA13,GPIO_AF0
#define DEBUG_DBTRGO_PA14_ PA14,GPIO_AF0
#define DEBUG_DBTRGO_PG9_ PG9,GPIO_AF0
#define _DEBUG_DBTRGO_PA13_ 1
#define _DEBUG_DBTRGO_PA14_ 1
#define _DEBUG_DBTRGO_PG9_ 1

#define DEBUG_TRACECLK_PC12_ PC12,GPIO_AF0
#define DEBUG_TRACECLK_PC3_ PC3,GPIO_AF0
#define DEBUG_TRACECLK_PE2_ PE2,GPIO_AF0
#define DEBUG_TRACECLK_PI14_ PI14,GPIO_AF0
#define _DEBUG_TRACECLK_PC12_ 1
#define _DEBUG_TRACECLK_PC3_ 1
#define _DEBUG_TRACECLK_PE2_ 1
#define _DEBUG_TRACECLK_PI14_ 1

#define DEBUG_TRACED0_PC1_ PC1,GPIO_AF0
#define DEBUG_TRACED0_PC8_ PC8,GPIO_AF0
#define DEBUG_TRACED0_PE3_ PE3,GPIO_AF0
#define DEBUG_TRACED0_PG0_ PG0,GPIO_AF0
#define DEBUG_TRACED0_PG13_ PG13,GPIO_AF0
#define DEBUG_TRACED0_PI12_ PI12,GPIO_AF0
#define _DEBUG_TRACED0_PC1_ 1
#define _DEBUG_TRACED0_PC8_ 1
#define _DEBUG_TRACED0_PE3_ 1
#define _DEBUG_TRACED0_PG0_ 1
#define _DEBUG_TRACED0_PG13_ 1
#define _DEBUG_TRACED0_PI12_ 1

#define DEBUG_TRACED1_PC9_ PC9,GPIO_AF0
#define DEBUG_TRACED1_PE4_ PE4,GPIO_AF0
#define DEBUG_TRACED1_PG1_ PG1,GPIO_AF0
#define DEBUG_TRACED1_PG14_ PG14,GPIO_AF0
#define DEBUG_TRACED1_PI13_ PI13,GPIO_AF0
#define _DEBUG_TRACED1_PC9_ 1
#define _DEBUG_TRACED1_PE4_ 1
#define _DEBUG_TRACED1_PG1_ 1
#define _DEBUG_TRACED1_PG14_ 1
#define _DEBUG_TRACED1_PI13_ 1

#define DEBUG_TRACED10_PG10_ PG10,GPIO_AF0
#define DEBUG_TRACED10_PJ2_ PJ2,GPIO_AF0
#define _DEBUG_TRACED10_PG10_ 1
#define _DEBUG_TRACED10_PJ2_ 1

#define DEBUG_TRACED11_PG11_ PG11,GPIO_AF0
#define DEBUG_TRACED11_PJ3_ PJ3,GPIO_AF0
#define _DEBUG_TRACED11_PG11_ 1
#define _DEBUG_TRACED11_PJ3_ 1

#define DEBUG_TRACED12_PF8_ PF8,GPIO_AF0
#define DEBUG_TRACED12_PJ4_ PJ4,GPIO_AF0
#define _DEBUG_TRACED12_PF8_ 1
#define _DEBUG_TRACED12_PJ4_ 1

#define DEBUG_TRACED13_PF9_ PF9,GPIO_AF0
#define DEBUG_TRACED13_PJ7_ PJ7,GPIO_AF0
#define _DEBUG_TRACED13_PF9_ 1
#define _DEBUG_TRACED13_PJ7_ 1

#define DEBUG_TRACED14_PG6_ PG6,GPIO_AF0
#define DEBUG_TRACED14_PJ8_ PJ8,GPIO_AF0
#define _DEBUG_TRACED14_PG6_ 1
#define _DEBUG_TRACED14_PJ8_ 1

#define DEBUG_TRACED15_PG8_ PG8,GPIO_AF0
#define DEBUG_TRACED15_PJ9_ PJ9,GPIO_AF0
#define _DEBUG_TRACED15_PG8_ 1
#define _DEBUG_TRACED15_PJ9_ 1

#define DEBUG_TRACED2_PC10_ PC10,GPIO_AF0
#define DEBUG_TRACED2_PE6_ PE6,GPIO_AF0
#define DEBUG_TRACED2_PG2_ PG2,GPIO_AF0
#define DEBUG_TRACED2_PJ5_ PJ5,GPIO_AF0
#define _DEBUG_TRACED2_PC10_ 1
#define _DEBUG_TRACED2_PE6_ 1
#define _DEBUG_TRACED2_PG2_ 1
#define _DEBUG_TRACED2_PJ5_ 1

#define DEBUG_TRACED3_PC11_ PC11,GPIO_AF0
#define DEBUG_TRACED3_PE5_ PE5,GPIO_AF0
#define DEBUG_TRACED3_PG3_ PG3,GPIO_AF0
#define DEBUG_TRACED3_PJ6_ PJ6,GPIO_AF0
#define _DEBUG_TRACED3_PC11_ 1
#define _DEBUG_TRACED3_PE5_ 1
#define _DEBUG_TRACED3_PG3_ 1
#define _DEBUG_TRACED3_PJ6_ 1

#define DEBUG_TRACED4_PB2_ PB2,GPIO_AF0
#define DEBUG_TRACED4_PF12_ PF12,GPIO_AF0
#define DEBUG_TRACED4_PK1_ PK1,GPIO_AF0
#define _DEBUG_TRACED4_PB2_ 1
#define _DEBUG_TRACED4_PF12_ 1
#define _DEBUG_TRACED4_PK1_ 1

#define DEBUG_TRACED5_PF13_ PF13,GPIO_AF0
#define DEBUG_TRACED5_PG7_ PG7,GPIO_AF0
#define DEBUG_TRACED5_PK2_ PK2,GPIO_AF0
#define _DEBUG_TRACED5_PF13_ 1
#define _DEBUG_TRACED5_PG7_ 1
#define _DEBUG_TRACED5_PK2_ 1

#define DEBUG_TRACED6_PD7_ PD7,GPIO_AF0
#define DEBUG_TRACED6_PF14_ PF14,GPIO_AF0
#define DEBUG_TRACED6_PK5_ PK5,GPIO_AF0
#define _DEBUG_TRACED6_PD7_ 1
#define _DEBUG_TRACED6_PF14_ 1
#define _DEBUG_TRACED6_PK5_ 1

#define DEBUG_TRACED7_PF15_ PF15,GPIO_AF0
#define DEBUG_TRACED7_PG15_ PG15,GPIO_AF0
#define DEBUG_TRACED7_PK6_ PK6,GPIO_AF0
#define _DEBUG_TRACED7_PF15_ 1
#define _DEBUG_TRACED7_PG15_ 1
#define _DEBUG_TRACED7_PK6_ 1

