susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
#define DEBUG_TRACED8_PB4_ PB4,GPIO_AF0
#define DEBUG_TRACED8_PJ0_ PJ0,GPIO_AF0
#define _DEBUG_TRACED8_PB4_ 1
#define _DEBUG_TRACED8_PJ0_ 1

#define DEBUG_TRACED9_PB3_ PB3,GPIO_AF0
#define DEBUG_TRACED9_PJ1_ PJ1,GPIO_AF0
#define _DEBUG_TRACED9_PB3_ 1
#define _DEBUG_TRACED9_PJ1_ 1

#define DFSDM1_CKIN0_PC0_ PC0,GPIO_AF3
#define DFSDM1_CKIN0_PD4_ PD4,GPIO_AF11
#define _DFSDM1_CKIN0_PC0_ 1
#define _DFSDM1_CKIN0_PD4_ 1

#define DFSDM1_CKIN1_PB13_ PB13,GPIO_AF6
#define DFSDM1_CKIN1_PB2_ PB2,GPIO_AF3
#define DFSDM1_CKIN1_PC2_ PC2,GPIO_AF3
#define DFSDM1_CKIN1_PD7_ PD7,GPIO_AF6
#define DFSDM1_CKIN1_PG3_ PG3,GPIO_AF4
#define _DFSDM1_CKIN1_PB13_ 1
#define _DFSDM1_CKIN1_PB2_ 1
#define _DFSDM1_CKIN1_PC2_ 1
#define _DFSDM1_CKIN1_PD7_ 1
#define _DFSDM1_CKIN1_PG3_ 1

#define DFSDM1_CKIN2_PB15_ PB15,GPIO_AF6
#define DFSDM1_CKIN2_PC4_ PC4,GPIO_AF3
#define DFSDM1_CKIN2_PE8_ PE8,GPIO_AF3
#define _DFSDM1_CKIN2_PB15_ 1
#define _DFSDM1_CKIN2_PC4_ 1
#define _DFSDM1_CKIN2_PE8_ 1

#define DFSDM1_CKIN3_PC6_ PC6,GPIO_AF4
#define DFSDM1_CKIN3_PD8_ PD8,GPIO_AF3
#define DFSDM1_CKIN3_PE5_ PE5,GPIO_AF3
#define _DFSDM1_CKIN3_PC6_ 1
#define _DFSDM1_CKIN3_PD8_ 1
#define _DFSDM1_CKIN3_PE5_ 1

#define DFSDM1_CKIN4_PC1_ PC1,GPIO_AF4
#define DFSDM1_CKIN4_PD6_ PD6,GPIO_AF3
#define DFSDM1_CKIN4_PE11_ PE11,GPIO_AF3
#define DFSDM1_CKIN4_PH3_ PH3,GPIO_AF3
#define _DFSDM1_CKIN4_PC1_ 1
#define _DFSDM1_CKIN4_PD6_ 1
#define _DFSDM1_CKIN4_PE11_ 1
#define _DFSDM1_CKIN4_PH3_ 1

#define DFSDM1_CKIN5_PB7_ PB7,GPIO_AF11
#define DFSDM1_CKIN5_PC10_ PC10,GPIO_AF3
#define DFSDM1_CKIN5_PE13_ PE13,GPIO_AF3
#define _DFSDM1_CKIN5_PB7_ 1
#define _DFSDM1_CKIN5_PC10_ 1
#define _DFSDM1_CKIN5_PE13_ 1

#define DFSDM1_CKIN6_PD0_ PD0,GPIO_AF3
#define DFSDM1_CKIN6_PF14_ PF14,GPIO_AF3
#define _DFSDM1_CKIN6_PD0_ 1
#define _DFSDM1_CKIN6_PF14_ 1

#define DFSDM1_CKIN7_PB11_ PB11,GPIO_AF6
#define DFSDM1_CKIN7_PB8_ PB8,GPIO_AF3
#define DFSDM1_CKIN7_PD1_ PD1,GPIO_AF11
#define _DFSDM1_CKIN7_PB11_ 1
#define _DFSDM1_CKIN7_PB8_ 1
#define _DFSDM1_CKIN7_PD1_ 1

#define DFSDM1_CKOUT_PB0_ PB0,GPIO_AF6
#define DFSDM1_CKOUT_PB13_ PB13,GPIO_AF3
#define DFSDM1_CKOUT_PC2_ PC2,GPIO_AF6
#define DFSDM1_CKOUT_PD10_ PD10,GPIO_AF3
#define DFSDM1_CKOUT_PD3_ PD3,GPIO_AF3
#define DFSDM1_CKOUT_PE9_ PE9,GPIO_AF3
#define _DFSDM1_CKOUT_PB0_ 1
#define _DFSDM1_CKOUT_PB13_ 1
#define _DFSDM1_CKOUT_PC2_ 1
#define _DFSDM1_CKOUT_PD10_ 1
#define _DFSDM1_CKOUT_PD3_ 1
#define _DFSDM1_CKOUT_PE9_ 1

#define DFSDM1_DATIN0_PC1_ PC1,GPIO_AF3
#define DFSDM1_DATIN0_PD3_ PD3,GPIO_AF6
#define DFSDM1_DATIN0_PG0_ PG0,GPIO_AF3
#define _DFSDM1_DATIN0_PC1_ 1
#define _DFSDM1_DATIN0_PD3_ 1
#define _DFSDM1_DATIN0_PG0_ 1

#define DFSDM1_DATIN1_PB1_ PB1,GPIO_AF6
#define DFSDM1_DATIN1_PB12_ PB12,GPIO_AF6
#define DFSDM1_DATIN1_PC3_ PC3,GPIO_AF3
#define DFSDM1_DATIN1_PD6_ PD6,GPIO_AF4
#define _DFSDM1_DATIN1_PB1_ 1
#define _DFSDM1_DATIN1_PB12_ 1
#define _DFSDM1_DATIN1_PC3_ 1
#define _DFSDM1_DATIN1_PD6_ 1

#define DFSDM1_DATIN2_PB14_ PB14,GPIO_AF6
#define DFSDM1_DATIN2_PC5_ PC5,GPIO_AF3
#define DFSDM1_DATIN2_PE7_ PE7,GPIO_AF3
#define _DFSDM1_DATIN2_PB14_ 1
#define _DFSDM1_DATIN2_PC5_ 1
#define _DFSDM1_DATIN2_PE7_ 1

#define DFSDM1_DATIN3_PC7_ PC7,GPIO_AF4
#define DFSDM1_DATIN3_PD9_ PD9,GPIO_AF3
#define DFSDM1_DATIN3_PE4_ PE4,GPIO_AF3
#define DFSDM1_DATIN3_PF13_ PF13,GPIO_AF6
#define _DFSDM1_DATIN3_PC7_ 1
#define _DFSDM1_DATIN3_PD9_ 1
#define _DFSDM1_DATIN3_PE4_ 1
#define _DFSDM1_DATIN3_PF13_ 1

#define DFSDM1_DATIN4_PC0_ PC0,GPIO_AF6
#define DFSDM1_DATIN4_PD7_ PD7,GPIO_AF3
#define DFSDM1_DATIN4_PE10_ PE10,GPIO_AF3
#define _DFSDM1_DATIN4_PC0_ 1
#define _DFSDM1_DATIN4_PD7_ 1
#define _DFSDM1_DATIN4_PE10_ 1

#define DFSDM1_DATIN5_PB6_ PB6,GPIO_AF11
#define DFSDM1_DATIN5_PC11_ PC11,GPIO_AF3
#define DFSDM1_DATIN5_PE12_ PE12,GPIO_AF3
#define _DFSDM1_DATIN5_PB6_ 1
#define _DFSDM1_DATIN5_PC11_ 1
#define _DFSDM1_DATIN5_PE12_ 1

#define DFSDM1_DATIN6_PD1_ PD1,GPIO_AF3
#define DFSDM1_DATIN6_PF13_ PF13,GPIO_AF3
#define _DFSDM1_DATIN6_PD1_ 1
#define _DFSDM1_DATIN6_PF13_ 1

#define DFSDM1_DATIN7_PB10_ PB10,GPIO_AF6
#define DFSDM1_DATIN7_PB9_ PB9,GPIO_AF3
#define DFSDM1_DATIN7_PD0_ PD0,GPIO_AF11
#define _DFSDM1_DATIN7_PB10_ 1
#define _DFSDM1_DATIN7_PB9_ 1
#define _DFSDM1_DATIN7_PD0_ 1

#define DSIHOST_TE_PB11_ PB11,GPIO_AF13
#define DSIHOST_TE_PC6_ PC6,GPIO_AF11
#define DSIHOST_TE_PD13_ PD13,GPIO_AF13
#define DSIHOST_TE_PJ2_ PJ2,GPIO_AF13
#define _DSIHOST_TE_PB11_ 1
#define _DSIHOST_TE_PC6_ 1
#define _DSIHOST_TE_PD13_ 1
#define _DSIHOST_TE_PJ2_ 1

#define ETH1_CLK_PA1_ PA1,GPIO_AF0
#define ETH1_CLK_PB5_ PB5,GPIO_AF0
#define ETH1_CLK_PG8_ PG8,GPIO_AF2
#define _ETH1_CLK_PA1_ 1
#define _ETH1_CLK_PB5_ 1
#define _ETH1_CLK_PG8_ 1

#define ETH1_CLK125_PG5_ PG5,GPIO_AF11
#define _ETH1_CLK125_PG5_ 1

#define ETH1_COL_PA3_ PA3,GPIO_AF11
#define ETH1_COL_PH3_ PH3,GPIO_AF11
#define _ETH1_COL_PA3_ 1
#define _ETH1_COL_PH3_ 1

#define ETH1_CRS_PA0_ PA0,GPIO_AF11
#define ETH1_CRS_PH2_ PH2,GPIO_AF11
#define _ETH1_CRS_PA0_ 1
#define _ETH1_CRS_PH2_ 1

#define ETH1_CRS_DV_PA7_ PA7,GPIO_AF11
#define _ETH1_CRS_DV_PA7_ 1

#define ETH1_GTX_CLK_PG4_ PG4,GPIO_AF11
#define _ETH1_GTX_CLK_PG4_ 1

#define ETH1_MDC_PC1_ PC1,GPIO_AF11
#define _ETH1_MDC_PC1_ 1

#define ETH1_MDIO_PA2_ PA2,GPIO_AF11
#define _ETH1_MDIO_PA2_ 1

#define ETH1_PHY_INTN_PG12_ PG12,GPIO_AF11
#define _ETH1_PHY_INTN_PG12_ 1

#define ETH1_PPS_OUT_PB5_ PB5,GPIO_AF11
#define ETH1_PPS_OUT_PG8_ PG8,GPIO_AF11
#define _ETH1_PPS_OUT_PB5_ 1
#define _ETH1_PPS_OUT_PG8_ 1

#define ETH1_REF_CLK_PA1_ PA1,GPIO_AF11
#define _ETH1_REF_CLK_PA1_ 1

#define ETH1_RXD0_PC4_ PC4,GPIO_AF11
#define _ETH1_RXD0_PC4_ 1

#define ETH1_RXD1_PC5_ PC5,GPIO_AF11
#define _ETH1_RXD1_PC5_ 1

#define ETH1_RXD2_PB0_ PB0,GPIO_AF11
#define ETH1_RXD2_PH6_ PH6,GPIO_AF11
#define _ETH1_RXD2_PB0_ 1
#define _ETH1_RXD2_PH6_ 1

#define ETH1_RXD3_PB1_ PB1,GPIO_AF11
#define ETH1_RXD3_PH7_ PH7,GPIO_AF11
#define _ETH1_RXD3_PB1_ 1
#define _ETH1_RXD3_PH7_ 1

#define ETH1_RXD4_PF12_ PF12,GPIO_AF11
#define _ETH1_RXD4_PF12_ 1

#define ETH1_RXD5_PF13_ PF13,GPIO_AF11
#define _ETH1_RXD5_PF13_ 1

#define ETH1_RXD6_PF14_ PF14,GPIO_AF11
#define _ETH1_RXD6_PF14_ 1

#define ETH1_RXD7_PF15_ PF15,GPIO_AF11
#define _ETH1_RXD7_PF15_ 1

#define ETH1_RX_CLK_PA1_ PA1,GPIO_AF11
#define _ETH1_RX_CLK_PA1_ 1

#define ETH1_RX_CTL_PA7_ PA7,GPIO_AF11
#define _ETH1_RX_CTL_PA7_ 1

#define ETH1_RX_DV_PA7_ PA7,GPIO_AF11
#define _ETH1_RX_DV_PA7_ 1

#define ETH1_RX_ER_PB10_ PB10,GPIO_AF11
#define ETH1_RX_ER_PI10_ PI10,GPIO_AF11
#define _ETH1_RX_ER_PB10_ 1
#define _ETH1_RX_ER_PI10_ 1

