susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
#define ETH1_TXD0_PB12_ PB12,GPIO_AF11
#define ETH1_TXD0_PG13_ PG13,GPIO_AF11
#define _ETH1_TXD0_PB12_ 1
#define _ETH1_TXD0_PG13_ 1

#define ETH1_TXD1_PB13_ PB13,GPIO_AF11
#define ETH1_TXD1_PG14_ PG14,GPIO_AF11
#define _ETH1_TXD1_PB13_ 1
#define _ETH1_TXD1_PG14_ 1

#define ETH1_TXD2_PC2_ PC2,GPIO_AF11
#define _ETH1_TXD2_PC2_ 1

#define ETH1_TXD3_PB8_ PB8,GPIO_AF11
#define ETH1_TXD3_PE2_ PE2,GPIO_AF11
#define _ETH1_TXD3_PB8_ 1
#define _ETH1_TXD3_PE2_ 1

#define ETH1_TXD4_PG0_ PG0,GPIO_AF11
#define _ETH1_TXD4_PG0_ 1

#define ETH1_TXD5_PG1_ PG1,GPIO_AF11
#define _ETH1_TXD5_PG1_ 1

#define ETH1_TXD6_PG2_ PG2,GPIO_AF11
#define _ETH1_TXD6_PG2_ 1

#define ETH1_TXD7_PG3_ PG3,GPIO_AF11
#define _ETH1_TXD7_PG3_ 1

#define ETH1_TX_CLK_PC3_ PC3,GPIO_AF11
#define _ETH1_TX_CLK_PC3_ 1

#define ETH1_TX_CTL_PB11_ PB11,GPIO_AF11
#define ETH1_TX_CTL_PG11_ PG11,GPIO_AF11
#define _ETH1_TX_CTL_PB11_ 1
#define _ETH1_TX_CTL_PG11_ 1

#define ETH1_TX_EN_PB11_ PB11,GPIO_AF11
#define ETH1_TX_EN_PG11_ PG11,GPIO_AF11
#define _ETH1_TX_EN_PB11_ 1
#define _ETH1_TX_EN_PG11_ 1

#define ETH1_TX_ER_PF3_ PF3,GPIO_AF11
#define _ETH1_TX_ER_PF3_ 1

#define FDCAN1_RX_PA11_ PA11,GPIO_AF9
#define FDCAN1_RX_PB8_ PB8,GPIO_AF9
#define FDCAN1_RX_PD0_ PD0,GPIO_AF9
#define FDCAN1_RX_PH14_ PH14,GPIO_AF9
#define FDCAN1_RX_PI9_ PI9,GPIO_AF9
#define _FDCAN1_RX_PA11_ 1
#define _FDCAN1_RX_PB8_ 1
#define _FDCAN1_RX_PD0_ 1
#define _FDCAN1_RX_PH14_ 1
#define _FDCAN1_RX_PI9_ 1

#define FDCAN1_TX_PA12_ PA12,GPIO_AF9
#define FDCAN1_TX_PB9_ PB9,GPIO_AF9
#define FDCAN1_TX_PD1_ PD1,GPIO_AF9
#define FDCAN1_TX_PH13_ PH13,GPIO_AF9
#define _FDCAN1_TX_PA12_ 1
#define _FDCAN1_TX_PB9_ 1
#define _FDCAN1_TX_PD1_ 1
#define _FDCAN1_TX_PH13_ 1

#define FDCAN2_RX_PB12_ PB12,GPIO_AF9
#define FDCAN2_RX_PB5_ PB5,GPIO_AF9
#define _FDCAN2_RX_PB12_ 1
#define _FDCAN2_RX_PB5_ 1

#define FDCAN2_TX_PB13_ PB13,GPIO_AF9
#define FDCAN2_TX_PB6_ PB6,GPIO_AF9
#define _FDCAN2_TX_PB13_ 1
#define _FDCAN2_TX_PB6_ 1

#define FMC_A0_PF0_ PF0,GPIO_AF12
#define _FMC_A0_PF0_ 1

#define FMC_A1_PF1_ PF1,GPIO_AF12
#define _FMC_A1_PF1_ 1

#define FMC_A10_PG0_ PG0,GPIO_AF12
#define _FMC_A10_PG0_ 1

#define FMC_A11_PG1_ PG1,GPIO_AF12
#define _FMC_A11_PG1_ 1

#define FMC_A12_PG2_ PG2,GPIO_AF12
#define _FMC_A12_PG2_ 1

#define FMC_A13_PG3_ PG3,GPIO_AF12
#define _FMC_A13_PG3_ 1

#define FMC_A14_PG4_ PG4,GPIO_AF12
#define _FMC_A14_PG4_ 1

#define FMC_A15_PG5_ PG5,GPIO_AF12
#define _FMC_A15_PG5_ 1

#define FMC_A16_PD11_ PD11,GPIO_AF12
#define _FMC_A16_PD11_ 1

#define FMC_A17_PD12_ PD12,GPIO_AF12
#define _FMC_A17_PD12_ 1

#define FMC_A18_PD13_ PD13,GPIO_AF12
#define _FMC_A18_PD13_ 1

#define FMC_A19_PE3_ PE3,GPIO_AF12
#define _FMC_A19_PE3_ 1

#define FMC_A2_PF2_ PF2,GPIO_AF12
#define _FMC_A2_PF2_ 1

#define FMC_A20_PE4_ PE4,GPIO_AF12
#define _FMC_A20_PE4_ 1

#define FMC_A21_PE5_ PE5,GPIO_AF12
#define _FMC_A21_PE5_ 1

#define FMC_A22_PE6_ PE6,GPIO_AF12
#define _FMC_A22_PE6_ 1

#define FMC_A23_PE2_ PE2,GPIO_AF12
#define _FMC_A23_PE2_ 1

#define FMC_A24_PG13_ PG13,GPIO_AF12
#define _FMC_A24_PG13_ 1

#define FMC_A25_PG14_ PG14,GPIO_AF12
#define _FMC_A25_PG14_ 1

#define FMC_A3_PF3_ PF3,GPIO_AF12
#define _FMC_A3_PF3_ 1

#define FMC_A4_PF4_ PF4,GPIO_AF12
#define _FMC_A4_PF4_ 1

#define FMC_A5_PF5_ PF5,GPIO_AF12
#define _FMC_A5_PF5_ 1

#define FMC_A6_PF12_ PF12,GPIO_AF12
#define _FMC_A6_PF12_ 1

#define FMC_A7_PF13_ PF13,GPIO_AF12
#define _FMC_A7_PF13_ 1

#define FMC_A8_PF14_ PF14,GPIO_AF12
#define _FMC_A8_PF14_ 1

#define FMC_A9_PF15_ PF15,GPIO_AF12
#define _FMC_A9_PF15_ 1

#define FMC_ALE_PD12_ PD12,GPIO_AF12
#define _FMC_ALE_PD12_ 1

#define FMC_CLE_PD11_ PD11,GPIO_AF12
#define _FMC_CLE_PD11_ 1

#define FMC_CLK_PD3_ PD3,GPIO_AF12
#define _FMC_CLK_PD3_ 1

#define FMC_D0_PD14_ PD14,GPIO_AF12
#define _FMC_D0_PD14_ 1

#define FMC_D1_PD15_ PD15,GPIO_AF12
#define _FMC_D1_PD15_ 1

#define FMC_D10_PE13_ PE13,GPIO_AF12
#define _FMC_D10_PE13_ 1

#define FMC_D11_PE14_ PE14,GPIO_AF12
#define _FMC_D11_PE14_ 1

#define FMC_D12_PE15_ PE15,GPIO_AF12
#define _FMC_D12_PE15_ 1

#define FMC_D13_PD8_ PD8,GPIO_AF12
#define _FMC_D13_PD8_ 1

#define FMC_D14_PD9_ PD9,GPIO_AF12
#define _FMC_D14_PD9_ 1

#define FMC_D15_PD10_ PD10,GPIO_AF12
#define _FMC_D15_PD10_ 1

#define FMC_D2_PD0_ PD0,GPIO_AF12
#define _FMC_D2_PD0_ 1

#define FMC_D3_PD1_ PD1,GPIO_AF12
#define _FMC_D3_PD1_ 1

#define FMC_D4_PE7_ PE7,GPIO_AF12
#define _FMC_D4_PE7_ 1

#define FMC_D5_PE8_ PE8,GPIO_AF12
#define _FMC_D5_PE8_ 1

#define FMC_D6_PE9_ PE9,GPIO_AF12
#define _FMC_D6_PE9_ 1

#define FMC_D7_PE10_ PE10,GPIO_AF12
#define _FMC_D7_PE10_ 1

#define FMC_D8_PE11_ PE11,GPIO_AF12
#define _FMC_D8_PE11_ 1

#define FMC_D9_PE12_ PE12,GPIO_AF12
#define _FMC_D9_PE12_ 1

#define FMC_DA0_PD14_ PD14,GPIO_AF12
#define _FMC_DA0_PD14_ 1

#define FMC_DA1_PD15_ PD15,GPIO_AF12
#define _FMC_DA1_PD15_ 1

#define FMC_DA10_PE13_ PE13,GPIO_AF12
#define _FMC_DA10_PE13_ 1

#define FMC_DA11_PE14_ PE14,GPIO_AF12
#define _FMC_DA11_PE14_ 1

#define FMC_DA12_PE15_ PE15,GPIO_AF12
#define _FMC_DA12_PE15_ 1

#define FMC_DA13_PD8_ PD8,GPIO_AF12
#define _FMC_DA13_PD8_ 1

#define FMC_DA14_PD9_ PD9,GPIO_AF12
#define _FMC_DA14_PD9_ 1

#define FMC_DA15_PD10_ PD10,GPIO_AF12
#define _FMC_DA15_PD10_ 1

#define FMC_DA2_PD0_ PD0,GPIO_AF12
#define _FMC_DA2_PD0_ 1

#define FMC_DA3_PD1_ PD1,GPIO_AF12
#define _FMC_DA3_PD1_ 1

#define FMC_DA4_PE7_ PE7,GPIO_AF12
#define _FMC_DA4_PE7_ 1

#define FMC_DA5_PE8_ PE8,GPIO_AF12
#define _FMC_DA5_PE8_ 1

#define FMC_DA6_PE9_ PE9,GPIO_AF12
#define _FMC_DA6_PE9_ 1

#define FMC_DA7_PE10_ PE10,GPIO_AF12
#define _FMC_DA7_PE10_ 1

#define FMC_DA8_PE11_ PE11,GPIO_AF12
#define _FMC_DA8_PE11_ 1

#define FMC_DA9_PE12_ PE12,GPIO_AF12
#define _FMC_DA9_PE12_ 1

#define FMC_NBL0_PE0_ PE0,GPIO_AF12
#define _FMC_NBL0_PE0_ 1

#define FMC_NBL1_PE1_ PE1,GPIO_AF12
#define _FMC_NBL1_PE1_ 1

#define FMC_NCE_PG9_ PG9,GPIO_AF12
#define _FMC_NCE_PG9_ 1

#define FMC_NCE2_PE15_ PE15,GPIO_AF10
#define _FMC_NCE2_PE15_ 1

#define FMC_NE1_PD7_ PD7,GPIO_AF12
#define _FMC_NE1_PD7_ 1

#define FMC_NE2_PG9_ PG9,GPIO_AF12
#define _FMC_NE2_PG9_ 1

#define FMC_NE3_PG10_ PG10,GPIO_AF12
#define _FMC_NE3_PG10_ 1

