susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
#define FMC_NE4_PG12_ PG12,GPIO_AF12
#define _FMC_NE4_PG12_ 1

#define FMC_NL_PB7_ PB7,GPIO_AF12
#define _FMC_NL_PB7_ 1

#define FMC_NOE_PD4_ PD4,GPIO_AF12
#define _FMC_NOE_PD4_ 1

#define FMC_NWAIT_PD6_ PD6,GPIO_AF12
#define _FMC_NWAIT_PD6_ 1

#define FMC_NWE_PD5_ PD5,GPIO_AF12
#define _FMC_NWE_PD5_ 1

#define HDP_HDP0_PA4_ PA4,GPIO_AF0
#define HDP_HDP0_PI10_ PI10,GPIO_AF0
#define HDP_HDP0_PI12_ PI12,GPIO_AF2
#define _HDP_HDP0_PA4_ 1
#define _HDP_HDP0_PI10_ 1
#define _HDP_HDP0_PI12_ 1

#define HDP_HDP1_PC6_ PC6,GPIO_AF0
#define HDP_HDP1_PI13_ PI13,GPIO_AF2
#define HDP_HDP1_PI9_ PI9,GPIO_AF0
#define _HDP_HDP1_PC6_ 1
#define _HDP_HDP1_PI13_ 1
#define _HDP_HDP1_PI9_ 1

#define HDP_HDP2_PE13_ PE13,GPIO_AF0
#define HDP_HDP2_PH12_ PH12,GPIO_AF0
#define HDP_HDP2_PJ5_ PJ5,GPIO_AF2
#define _HDP_HDP2_PE13_ 1
#define _HDP_HDP2_PH12_ 1
#define _HDP_HDP2_PJ5_ 1

#define HDP_HDP3_PE15_ PE15,GPIO_AF0
#define HDP_HDP3_PJ6_ PJ6,GPIO_AF2
#define _HDP_HDP3_PE15_ 1
#define _HDP_HDP3_PJ6_ 1

#define HDP_HDP4_PC7_ PC7,GPIO_AF0
#define HDP_HDP4_PK1_ PK1,GPIO_AF2
#define _HDP_HDP4_PC7_ 1
#define _HDP_HDP4_PK1_ 1

#define HDP_HDP5_PD3_ PD3,GPIO_AF0
#define HDP_HDP5_PK2_ PK2,GPIO_AF2
#define _HDP_HDP5_PD3_ 1
#define _HDP_HDP5_PK2_ 1

#define HDP_HDP6_PB8_ PB8,GPIO_AF0
#define HDP_HDP6_PK5_ PK5,GPIO_AF2
#define _HDP_HDP6_PB8_ 1
#define _HDP_HDP6_PK5_ 1

#define HDP_HDP7_PB9_ PB9,GPIO_AF0
#define HDP_HDP7_PK6_ PK6,GPIO_AF2
#define _HDP_HDP7_PB9_ 1
#define _HDP_HDP7_PK6_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define I2C1_SCL_PD12_ PD12,GPIO_AF5
#define I2C1_SCL_PF14_ PF14,GPIO_AF5
#define I2C1_SCL_PH11_ PH11,GPIO_AF5
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1
#define _I2C1_SCL_PD12_ 1
#define _I2C1_SCL_PF14_ 1
#define _I2C1_SCL_PH11_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define I2C1_SDA_PD13_ PD13,GPIO_AF5
#define I2C1_SDA_PF15_ PF15,GPIO_AF5
#define I2C1_SDA_PH12_ PH12,GPIO_AF5
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1
#define _I2C1_SDA_PD13_ 1
#define _I2C1_SDA_PF15_ 1
#define _I2C1_SDA_PH12_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define I2C1_SMBA_PD11_ PD11,GPIO_AF5
#define I2C1_SMBA_PF13_ PF13,GPIO_AF5
#define I2C1_SMBA_PH10_ PH10,GPIO_AF5
#define _I2C1_SMBA_PB5_ 1
#define _I2C1_SMBA_PD11_ 1
#define _I2C1_SMBA_PF13_ 1
#define _I2C1_SMBA_PH10_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define I2C2_SCL_PD7_ PD7,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define I2C2_SCL_PH4_ PH4,GPIO_AF4
#define I2C2_SCL_PZ0_ PZ0,GPIO_AF3
#define I2C2_SCL_PZ2_ PZ2,GPIO_AF3
#define I2C2_SCL_PZ4_ PZ4,GPIO_AF3
#define I2C2_SCL_PZ6_ PZ6,GPIO_AF3
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PD7_ 1
#define _I2C2_SCL_PF1_ 1
#define _I2C2_SCL_PH4_ 1
#define _I2C2_SCL_PZ0_ 1
#define _I2C2_SCL_PZ2_ 1
#define _I2C2_SCL_PZ4_ 1
#define _I2C2_SCL_PZ6_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define I2C2_SDA_PG15_ PG15,GPIO_AF4
#define I2C2_SDA_PH5_ PH5,GPIO_AF4
#define I2C2_SDA_PZ1_ PZ1,GPIO_AF3
#define I2C2_SDA_PZ3_ PZ3,GPIO_AF3
#define I2C2_SDA_PZ5_ PZ5,GPIO_AF3
#define I2C2_SDA_PZ7_ PZ7,GPIO_AF3
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PF0_ 1
#define _I2C2_SDA_PG15_ 1
#define _I2C2_SDA_PH5_ 1
#define _I2C2_SDA_PZ1_ 1
#define _I2C2_SDA_PZ3_ 1
#define _I2C2_SDA_PZ5_ 1
#define _I2C2_SDA_PZ7_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define I2C2_SMBA_PH6_ PH6,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PF2_ 1
#define _I2C2_SMBA_PH6_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF4
#define I2C3_SCL_PH7_ PH7,GPIO_AF4
#define _I2C3_SCL_PA8_ 1
#define _I2C3_SCL_PH7_ 1

#define I2C3_SDA_PC9_ PC9,GPIO_AF4
#define I2C3_SDA_PH8_ PH8,GPIO_AF4
#define _I2C3_SDA_PC9_ 1
#define _I2C3_SDA_PH8_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF4
#define I2C3_SMBA_PH9_ PH9,GPIO_AF4
#define _I2C3_SMBA_PA9_ 1
#define _I2C3_SMBA_PH9_ 1

#define I2C4_SCL_PB6_ PB6,GPIO_AF6
#define I2C4_SCL_PB8_ PB8,GPIO_AF6
#define I2C4_SCL_PD12_ PD12,GPIO_AF4
#define I2C4_SCL_PE2_ PE2,GPIO_AF4
#define I2C4_SCL_PF14_ PF14,GPIO_AF4
#define I2C4_SCL_PH11_ PH11,GPIO_AF4
#define I2C4_SCL_PZ4_ PZ4,GPIO_AF6
#define _I2C4_SCL_PB6_ 1
#define _I2C4_SCL_PB8_ 1
#define _I2C4_SCL_PD12_ 1
#define _I2C4_SCL_PE2_ 1
#define _I2C4_SCL_PF14_ 1
#define _I2C4_SCL_PH11_ 1
#define _I2C4_SCL_PZ4_ 1

#define I2C4_SDA_PB7_ PB7,GPIO_AF6
#define I2C4_SDA_PB9_ PB9,GPIO_AF6
#define I2C4_SDA_PD13_ PD13,GPIO_AF4
#define I2C4_SDA_PF15_ PF15,GPIO_AF4
#define I2C4_SDA_PH12_ PH12,GPIO_AF4
#define I2C4_SDA_PZ1_ PZ1,GPIO_AF6
#define I2C4_SDA_PZ3_ PZ3,GPIO_AF6
#define I2C4_SDA_PZ5_ PZ5,GPIO_AF6
#define _I2C4_SDA_PB7_ 1
#define _I2C4_SDA_PB9_ 1
#define _I2C4_SDA_PD13_ 1
#define _I2C4_SDA_PF15_ 1
#define _I2C4_SDA_PH12_ 1
#define _I2C4_SDA_PZ1_ 1
#define _I2C4_SDA_PZ3_ 1
#define _I2C4_SDA_PZ5_ 1

#define I2C4_SMBA_PB5_ PB5,GPIO_AF6
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define I2C4_SMBA_PF13_ PF13,GPIO_AF4
#define I2C4_SMBA_PH10_ PH10,GPIO_AF4
#define I2C4_SMBA_PZ2_ PZ2,GPIO_AF6
#define I2C4_SMBA_PZ6_ PZ6,GPIO_AF6
#define _I2C4_SMBA_PB5_ 1
#define _I2C4_SMBA_PD11_ 1
#define _I2C4_SMBA_PF13_ 1
#define _I2C4_SMBA_PH10_ 1
#define _I2C4_SMBA_PZ2_ 1
#define _I2C4_SMBA_PZ6_ 1

#define I2C5_SCL_PA11_ PA11,GPIO_AF4
#define I2C5_SCL_PD1_ PD1,GPIO_AF4
#define I2C5_SCL_PZ4_ PZ4,GPIO_AF4
#define _I2C5_SCL_PA11_ 1
#define _I2C5_SCL_PD1_ 1
#define _I2C5_SCL_PZ4_ 1

#define I2C5_SDA_PA12_ PA12,GPIO_AF4
#define I2C5_SDA_PD0_ PD0,GPIO_AF4
#define I2C5_SDA_PZ1_ PZ1,GPIO_AF4
#define I2C5_SDA_PZ3_ PZ3,GPIO_AF4
#define I2C5_SDA_PZ5_ PZ5,GPIO_AF4
#define _I2C5_SDA_PA12_ 1
#define _I2C5_SDA_PD0_ 1
#define _I2C5_SDA_PZ1_ 1
#define _I2C5_SDA_PZ3_ 1
#define _I2C5_SDA_PZ5_ 1

#define I2C5_SMBA_PD10_ PD10,GPIO_AF4
#define I2C5_SMBA_PD2_ PD2,GPIO_AF4
#define I2C5_SMBA_PZ2_ PZ2,GPIO_AF4
#define _I2C5_SMBA_PD10_ 1
#define _I2C5_SMBA_PD2_ 1
#define _I2C5_SMBA_PZ2_ 1

#define I2C6_SCL_PA11_ PA11,GPIO_AF2
#define I2C6_SCL_PD1_ PD1,GPIO_AF2
#define I2C6_SCL_PZ0_ PZ0,GPIO_AF2
#define I2C6_SCL_PZ2_ PZ2,GPIO_AF2
#define I2C6_SCL_PZ4_ PZ4,GPIO_AF2
#define I2C6_SCL_PZ6_ PZ6,GPIO_AF2
#define _I2C6_SCL_PA11_ 1
#define _I2C6_SCL_PD1_ 1
#define _I2C6_SCL_PZ0_ 1
#define _I2C6_SCL_PZ2_ 1
#define _I2C6_SCL_PZ4_ 1
#define _I2C6_SCL_PZ6_ 1

#define I2C6_SDA_PA12_ PA12,GPIO_AF2
#define I2C6_SDA_PD0_ PD0,GPIO_AF2
#define I2C6_SDA_PZ1_ PZ1,GPIO_AF2
#define I2C6_SDA_PZ3_ PZ3,GPIO_AF2
#define I2C6_SDA_PZ5_ PZ5,GPIO_AF2
#define I2C6_SDA_PZ7_ PZ7,GPIO_AF2
#define _I2C6_SDA_PA12_ 1
#define _I2C6_SDA_PD0_ 1
#define _I2C6_SDA_PZ1_ 1
#define _I2C6_SDA_PZ3_ 1
#define _I2C6_SDA_PZ5_ 1
#define _I2C6_SDA_PZ7_ 1

