susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
#define I2C6_SMBA_PB12_ PB12,GPIO_AF2
#define _I2C6_SMBA_PB12_ 1

#define I2S1_CK_PA5_ PA5,GPIO_AF5
#define I2S1_CK_PB3_ PB3,GPIO_AF5
#define I2S1_CK_PZ0_ PZ0,GPIO_AF5
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3_ 1
#define _I2S1_CK_PZ0_ 1

#define I2S1_MCK_PC4_ PC4,GPIO_AF5
#define I2S1_MCK_PZ6_ PZ6,GPIO_AF5
#define _I2S1_MCK_PC4_ 1
#define _I2S1_MCK_PZ6_ 1

#define I2S1_SDI_PA6_ PA6,GPIO_AF5
#define I2S1_SDI_PB4_ PB4,GPIO_AF5
#define I2S1_SDI_PZ1_ PZ1,GPIO_AF5
#define _I2S1_SDI_PA6_ 1
#define _I2S1_SDI_PB4_ 1
#define _I2S1_SDI_PZ1_ 1

#define I2S1_SDO_PA7_ PA7,GPIO_AF5
#define I2S1_SDO_PB5_ PB5,GPIO_AF5
#define I2S1_SDO_PZ2_ PZ2,GPIO_AF5
#define _I2S1_SDO_PA7_ 1
#define _I2S1_SDO_PB5_ 1
#define _I2S1_SDO_PZ2_ 1

#define I2S1_WS_PA15_ PA15,GPIO_AF5
#define I2S1_WS_PA4_ PA4,GPIO_AF5
#define I2S1_WS_PZ3_ PZ3,GPIO_AF5
#define _I2S1_WS_PA15_ 1
#define _I2S1_WS_PA4_ 1
#define _I2S1_WS_PZ3_ 1

#define I2S2_CK_PA9_ PA9,GPIO_AF5
#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PD3_ PD3,GPIO_AF5
#define I2S2_CK_PI1_ PI1,GPIO_AF5
#define _I2S2_CK_PA9_ 1
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PD3_ 1
#define _I2S2_CK_PI1_ 1

#define I2S2_MCK_PC6_ PC6,GPIO_AF5
#define I2S2_MCK_PE1_ PE1,GPIO_AF5
#define _I2S2_MCK_PC6_ 1
#define _I2S2_MCK_PE1_ 1

#define I2S2_SDI_PB14_ PB14,GPIO_AF5
#define I2S2_SDI_PC2_ PC2,GPIO_AF5
#define I2S2_SDI_PI2_ PI2,GPIO_AF5
#define _I2S2_SDI_PB14_ 1
#define _I2S2_SDI_PC2_ 1
#define _I2S2_SDI_PI2_ 1

#define I2S2_SDO_PB15_ PB15,GPIO_AF5
#define I2S2_SDO_PC1_ PC1,GPIO_AF5
#define I2S2_SDO_PC3_ PC3,GPIO_AF5
#define I2S2_SDO_PI3_ PI3,GPIO_AF5
#define _I2S2_SDO_PB15_ 1
#define _I2S2_SDO_PC1_ 1
#define _I2S2_SDO_PC3_ 1
#define _I2S2_SDO_PI3_ 1

#define I2S2_WS_PA11_ PA11,GPIO_AF5
#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PB4_ PB4,GPIO_AF7
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define I2S2_WS_PI0_ PI0,GPIO_AF5
#define _I2S2_WS_PA11_ 1
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB4_ 1
#define _I2S2_WS_PB9_ 1
#define _I2S2_WS_PI0_ 1

#define I2S3_CK_PB3_ PB3,GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define I2S3_CK_PE0_ PE0,GPIO_AF5
#define _I2S3_CK_PB3_ 1
#define _I2S3_CK_PC10_ 1
#define _I2S3_CK_PE0_ 1

#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define I2S3_MCK_PD13_ PD13,GPIO_AF6
#define _I2S3_MCK_PC7_ 1
#define _I2S3_MCK_PD13_ 1

#define I2S3_SDI_PB4_ PB4,GPIO_AF6
#define I2S3_SDI_PC11_ PC11,GPIO_AF6
#define I2S3_SDI_PD10_ PD10,GPIO_AF5
#define _I2S3_SDI_PB4_ 1
#define _I2S3_SDI_PC11_ 1
#define _I2S3_SDI_PD10_ 1

#define I2S3_SDO_PA8_ PA8,GPIO_AF5
#define I2S3_SDO_PB2_ PB2,GPIO_AF7
#define I2S3_SDO_PB5_ PB5,GPIO_AF7
#define I2S3_SDO_PC12_ PC12,GPIO_AF6
#define I2S3_SDO_PD6_ PD6,GPIO_AF5
#define _I2S3_SDO_PA8_ 1
#define _I2S3_SDO_PB2_ 1
#define _I2S3_SDO_PB5_ 1
#define _I2S3_SDO_PC12_ 1
#define _I2S3_SDO_PD6_ 1

#define I2S3_WS_PA10_ PA10,GPIO_AF5
#define I2S3_WS_PA15_ PA15,GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA10_ 1
#define _I2S3_WS_PA15_ 1
#define _I2S3_WS_PA4_ 1

#define I2S_CKIN_PB2_ PB2,GPIO_AF5
#define I2S_CKIN_PC9_ PC9,GPIO_AF5
#define I2S_CKIN_PI11_ PI11,GPIO_AF5
#define _I2S_CKIN_PB2_ 1
#define _I2S_CKIN_PC9_ 1
#define _I2S_CKIN_PI11_ 1

#define LPTIM1_ETR_PE0_ PE0,GPIO_AF1
#define LPTIM1_ETR_PG14_ PG14,GPIO_AF1
#define _LPTIM1_ETR_PE0_ 1
#define _LPTIM1_ETR_PG14_ 1

#define LPTIM1_IN1_PD12_ PD12,GPIO_AF1
#define LPTIM1_IN1_PG12_ PG12,GPIO_AF1
#define _LPTIM1_IN1_PD12_ 1
#define _LPTIM1_IN1_PG12_ 1

#define LPTIM1_IN2_PE1_ PE1,GPIO_AF1
#define LPTIM1_IN2_PH2_ PH2,GPIO_AF1
#define _LPTIM1_IN2_PE1_ 1
#define _LPTIM1_IN2_PH2_ 1

#define LPTIM1_OUT_PD13_ PD13,GPIO_AF1
#define LPTIM1_OUT_PG13_ PG13,GPIO_AF1
#define _LPTIM1_OUT_PD13_ 1
#define _LPTIM1_OUT_PG13_ 1

#define LPTIM2_ETR_PB11_ PB11,GPIO_AF3
#define LPTIM2_ETR_PE0_ PE0,GPIO_AF4
#define _LPTIM2_ETR_PB11_ 1
#define _LPTIM2_ETR_PE0_ 1

#define LPTIM2_IN1_PB10_ PB10,GPIO_AF3
#define LPTIM2_IN1_PD12_ PD12,GPIO_AF3
#define _LPTIM2_IN1_PB10_ 1
#define _LPTIM2_IN1_PD12_ 1

#define LPTIM2_IN2_PC0_ PC0,GPIO_AF4
#define LPTIM2_IN2_PD11_ PD11,GPIO_AF3
#define _LPTIM2_IN2_PC0_ 1
#define _LPTIM2_IN2_PD11_ 1

#define LPTIM2_OUT_PB13_ PB13,GPIO_AF4
#define _LPTIM2_OUT_PB13_ 1

#define LPTIM3_OUT_PA1_ PA1,GPIO_AF3
#define _LPTIM3_OUT_PA1_ 1

#define LPTIM4_OUT_PA2_ PA2,GPIO_AF3
#define _LPTIM4_OUT_PA2_ 1

#define LPTIM5_OUT_PA3_ PA3,GPIO_AF3
#define _LPTIM5_OUT_PA3_ 1

#define LTDC_B0_PD9_ PD9,GPIO_AF14
#define LTDC_B0_PE4_ PE4,GPIO_AF14
#define LTDC_B0_PG14_ PG14,GPIO_AF14
#define LTDC_B0_PJ12_ PJ12,GPIO_AF14
#define _LTDC_B0_PD9_ 1
#define _LTDC_B0_PE4_ 1
#define _LTDC_B0_PG14_ 1
#define _LTDC_B0_PJ12_ 1

#define LTDC_B1_PA10_ PA10,GPIO_AF14
#define LTDC_B1_PG12_ PG12,GPIO_AF14
#define LTDC_B1_PJ13_ PJ13,GPIO_AF14
#define _LTDC_B1_PA10_ 1
#define _LTDC_B1_PG12_ 1
#define _LTDC_B1_PJ13_ 1

#define LTDC_B2_PA3_ PA3,GPIO_AF9
#define LTDC_B2_PC9_ PC9,GPIO_AF14
#define LTDC_B2_PD6_ PD6,GPIO_AF14
#define LTDC_B2_PG10_ PG10,GPIO_AF14
#define LTDC_B2_PJ14_ PJ14,GPIO_AF14
#define _LTDC_B2_PA3_ 1
#define _LTDC_B2_PC9_ 1
#define _LTDC_B2_PD6_ 1
#define _LTDC_B2_PG10_ 1
#define _LTDC_B2_PJ14_ 1

#define LTDC_B3_PD10_ PD10,GPIO_AF14
#define LTDC_B3_PG11_ PG11,GPIO_AF14
#define LTDC_B3_PJ15_ PJ15,GPIO_AF14
#define _LTDC_B3_PD10_ 1
#define _LTDC_B3_PG11_ 1
#define _LTDC_B3_PJ15_ 1

#define LTDC_B4_PE12_ PE12,GPIO_AF14
#define LTDC_B4_PG12_ PG12,GPIO_AF9
#define LTDC_B4_PI4_ PI4,GPIO_AF14
#define LTDC_B4_PK3_ PK3,GPIO_AF14
#define _LTDC_B4_PE12_ 1
#define _LTDC_B4_PG12_ 1
#define _LTDC_B4_PI4_ 1
#define _LTDC_B4_PK3_ 1

#define LTDC_B5_PA3_ PA3,GPIO_AF14
#define LTDC_B5_PI5_ PI5,GPIO_AF14
#define LTDC_B5_PK4_ PK4,GPIO_AF14
#define _LTDC_B5_PA3_ 1
#define _LTDC_B5_PI5_ 1
#define _LTDC_B5_PK4_ 1

#define LTDC_B6_PB8_ PB8,GPIO_AF14
#define LTDC_B6_PI6_ PI6,GPIO_AF14
#define LTDC_B6_PK5_ PK5,GPIO_AF14
#define _LTDC_B6_PB8_ 1
#define _LTDC_B6_PI6_ 1
#define _LTDC_B6_PK5_ 1

#define LTDC_B7_PB9_ PB9,GPIO_AF14
#define LTDC_B7_PD8_ PD8,GPIO_AF14
#define LTDC_B7_PI7_ PI7,GPIO_AF14
#define LTDC_B7_PK6_ PK6,GPIO_AF14
#define _LTDC_B7_PB9_ 1
#define _LTDC_B7_PD8_ 1
#define _LTDC_B7_PI7_ 1
#define _LTDC_B7_PK6_ 1

#define LTDC_CLK_PE14_ PE14,GPIO_AF14
#define LTDC_CLK_PG7_ PG7,GPIO_AF14
#define LTDC_CLK_PI14_ PI14,GPIO_AF14
#define _LTDC_CLK_PE14_ 1
#define _LTDC_CLK_PG7_ 1
#define _LTDC_CLK_PI14_ 1

#define LTDC_DE_PE13_ PE13,GPIO_AF14
#define LTDC_DE_PF10_ PF10,GPIO_AF14
#define LTDC_DE_PK7_ PK7,GPIO_AF14
#define _LTDC_DE_PE13_ 1
#define _LTDC_DE_PF10_ 1
#define _LTDC_DE_PK7_ 1

#define LTDC_G0_PB1_ PB1,GPIO_AF14
#define LTDC_G0_PE14_ PE14,GPIO_AF13
#define LTDC_G0_PE5_ PE5,GPIO_AF14
#define LTDC_G0_PJ7_ PJ7,GPIO_AF14
#define _LTDC_G0_PB1_ 1
#define _LTDC_G0_PE14_ 1
#define _LTDC_G0_PE5_ 1
#define _LTDC_G0_PJ7_ 1

