susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
#define LTDC_G1_PB0_ PB0,GPIO_AF14
#define LTDC_G1_PE6_ PE6,GPIO_AF14
#define LTDC_G1_PJ8_ PJ8,GPIO_AF14
#define _LTDC_G1_PB0_ 1
#define _LTDC_G1_PE6_ 1
#define _LTDC_G1_PJ8_ 1

#define LTDC_G2_PA6_ PA6,GPIO_AF14
#define LTDC_G2_PH13_ PH13,GPIO_AF14
#define LTDC_G2_PI15_ PI15,GPIO_AF9
#define LTDC_G2_PJ9_ PJ9,GPIO_AF14
#define _LTDC_G2_PA6_ 1
#define _LTDC_G2_PH13_ 1
#define _LTDC_G2_PI15_ 1
#define _LTDC_G2_PJ9_ 1

#define LTDC_G3_PE11_ PE11,GPIO_AF14
#define LTDC_G3_PG10_ PG10,GPIO_AF9
#define LTDC_G3_PH14_ PH14,GPIO_AF14
#define LTDC_G3_PJ10_ PJ10,GPIO_AF14
#define LTDC_G3_PJ12_ PJ12,GPIO_AF9
#define _LTDC_G3_PE11_ 1
#define _LTDC_G3_PG10_ 1
#define _LTDC_G3_PH14_ 1
#define _LTDC_G3_PJ10_ 1
#define _LTDC_G3_PJ12_ 1

#define LTDC_G4_PB10_ PB10,GPIO_AF14
#define LTDC_G4_PH15_ PH15,GPIO_AF14
#define LTDC_G4_PH4_ PH4,GPIO_AF14
#define LTDC_G4_PJ11_ PJ11,GPIO_AF14
#define LTDC_G4_PJ13_ PJ13,GPIO_AF9
#define _LTDC_G4_PB10_ 1
#define _LTDC_G4_PH15_ 1
#define _LTDC_G4_PH4_ 1
#define _LTDC_G4_PJ11_ 1
#define _LTDC_G4_PJ13_ 1

#define LTDC_G5_PB11_ PB11,GPIO_AF14
#define LTDC_G5_PF11_ PF11,GPIO_AF14
#define LTDC_G5_PH4_ PH4,GPIO_AF9
#define LTDC_G5_PI0_ PI0,GPIO_AF14
#define LTDC_G5_PK0_ PK0,GPIO_AF14
#define _LTDC_G5_PB11_ 1
#define _LTDC_G5_PF11_ 1
#define _LTDC_G5_PH4_ 1
#define _LTDC_G5_PI0_ 1
#define _LTDC_G5_PK0_ 1

#define LTDC_G6_PC7_ PC7,GPIO_AF14
#define LTDC_G6_PI1_ PI1,GPIO_AF14
#define LTDC_G6_PI11_ PI11,GPIO_AF9
#define LTDC_G6_PK1_ PK1,GPIO_AF14
#define _LTDC_G6_PC7_ 1
#define _LTDC_G6_PI1_ 1
#define _LTDC_G6_PI11_ 1
#define _LTDC_G6_PK1_ 1

#define LTDC_G7_PB5_ PB5,GPIO_AF14
#define LTDC_G7_PD3_ PD3,GPIO_AF14
#define LTDC_G7_PG8_ PG8,GPIO_AF14
#define LTDC_G7_PI2_ PI2,GPIO_AF14
#define LTDC_G7_PK2_ PK2,GPIO_AF14
#define _LTDC_G7_PB5_ 1
#define _LTDC_G7_PD3_ 1
#define _LTDC_G7_PG8_ 1
#define _LTDC_G7_PI2_ 1
#define _LTDC_G7_PK2_ 1

#define LTDC_HSYNC_PC6_ PC6,GPIO_AF14
#define LTDC_HSYNC_PI10_ PI10,GPIO_AF14
#define LTDC_HSYNC_PI12_ PI12,GPIO_AF14
#define _LTDC_HSYNC_PC6_ 1
#define _LTDC_HSYNC_PI10_ 1
#define _LTDC_HSYNC_PI12_ 1

#define LTDC_R0_PG13_ PG13,GPIO_AF14
#define LTDC_R0_PH2_ PH2,GPIO_AF14
#define LTDC_R0_PI15_ PI15,GPIO_AF14
#define _LTDC_R0_PG13_ 1
#define _LTDC_R0_PH2_ 1
#define _LTDC_R0_PI15_ 1

#define LTDC_R1_PA15_ PA15,GPIO_AF14
#define LTDC_R1_PA2_ PA2,GPIO_AF14
#define LTDC_R1_PD15_ PD15,GPIO_AF14
#define LTDC_R1_PG9_ PG9,GPIO_AF14
#define LTDC_R1_PH3_ PH3,GPIO_AF14
#define LTDC_R1_PJ0_ PJ0,GPIO_AF14
#define _LTDC_R1_PA15_ 1
#define _LTDC_R1_PA2_ 1
#define _LTDC_R1_PD15_ 1
#define _LTDC_R1_PG9_ 1
#define _LTDC_R1_PH3_ 1
#define _LTDC_R1_PJ0_ 1

#define LTDC_R2_PA1_ PA1,GPIO_AF14
#define LTDC_R2_PC10_ PC10,GPIO_AF14
#define LTDC_R2_PH8_ PH8,GPIO_AF14
#define LTDC_R2_PJ1_ PJ1,GPIO_AF14
#define _LTDC_R2_PA1_ 1
#define _LTDC_R2_PC10_ 1
#define _LTDC_R2_PH8_ 1
#define _LTDC_R2_PJ1_ 1

#define LTDC_R3_PB0_ PB0,GPIO_AF9
#define LTDC_R3_PH9_ PH9,GPIO_AF14
#define LTDC_R3_PJ2_ PJ2,GPIO_AF14
#define _LTDC_R3_PB0_ 1
#define _LTDC_R3_PH9_ 1
#define _LTDC_R3_PJ2_ 1

#define LTDC_R4_PA11_ PA11,GPIO_AF14
#define LTDC_R4_PA5_ PA5,GPIO_AF14
#define LTDC_R4_PH10_ PH10,GPIO_AF14
#define LTDC_R4_PJ3_ PJ3,GPIO_AF14
#define _LTDC_R4_PA11_ 1
#define _LTDC_R4_PA5_ 1
#define _LTDC_R4_PH10_ 1
#define _LTDC_R4_PJ3_ 1

#define LTDC_R5_PA12_ PA12,GPIO_AF14
#define LTDC_R5_PA9_ PA9,GPIO_AF14
#define LTDC_R5_PC0_ PC0,GPIO_AF14
#define LTDC_R5_PH11_ PH11,GPIO_AF14
#define LTDC_R5_PJ4_ PJ4,GPIO_AF14
#define _LTDC_R5_PA12_ 1
#define _LTDC_R5_PA9_ 1
#define _LTDC_R5_PC0_ 1
#define _LTDC_R5_PH11_ 1
#define _LTDC_R5_PJ4_ 1

#define LTDC_R6_PA8_ PA8,GPIO_AF14
#define LTDC_R6_PB1_ PB1,GPIO_AF9
#define LTDC_R6_PH12_ PH12,GPIO_AF14
#define LTDC_R6_PJ5_ PJ5,GPIO_AF14
#define _LTDC_R6_PA8_ 1
#define _LTDC_R6_PB1_ 1
#define _LTDC_R6_PH12_ 1
#define _LTDC_R6_PJ5_ 1

#define LTDC_R7_PE15_ PE15,GPIO_AF14
#define LTDC_R7_PG6_ PG6,GPIO_AF14
#define LTDC_R7_PJ0_ PJ0,GPIO_AF9
#define LTDC_R7_PJ6_ PJ6,GPIO_AF14
#define _LTDC_R7_PE15_ 1
#define _LTDC_R7_PG6_ 1
#define _LTDC_R7_PJ0_ 1
#define _LTDC_R7_PJ6_ 1

#define LTDC_VSYNC_PA4_ PA4,GPIO_AF14
#define LTDC_VSYNC_PI13_ PI13,GPIO_AF14
#define LTDC_VSYNC_PI9_ PI9,GPIO_AF14
#define _LTDC_VSYNC_PA4_ 1
#define _LTDC_VSYNC_PI13_ 1
#define _LTDC_VSYNC_PI9_ 1

#define MDIOS_MDC_PA6_ PA6,GPIO_AF11
#define MDIOS_MDC_PB1_ PB1,GPIO_AF12
#define MDIOS_MDC_PC1_ PC1,GPIO_AF12
#define MDIOS_MDC_PH7_ PH7,GPIO_AF12
#define _MDIOS_MDC_PA6_ 1
#define _MDIOS_MDC_PB1_ 1
#define _MDIOS_MDC_PC1_ 1
#define _MDIOS_MDC_PH7_ 1

#define MDIOS_MDIO_PA10_ PA10,GPIO_AF11
#define MDIOS_MDIO_PA2_ PA2,GPIO_AF12
#define MDIOS_MDIO_PB0_ PB0,GPIO_AF12
#define MDIOS_MDIO_PH6_ PH6,GPIO_AF12
#define _MDIOS_MDIO_PA10_ 1
#define _MDIOS_MDIO_PA2_ 1
#define _MDIOS_MDIO_PB0_ 1
#define _MDIOS_MDIO_PH6_ 1

#define QUADSPI_BK1_IO0_PC9_ PC9,GPIO_AF9
#define QUADSPI_BK1_IO0_PD11_ PD11,GPIO_AF9
#define QUADSPI_BK1_IO0_PF8_ PF8,GPIO_AF10
#define _QUADSPI_BK1_IO0_PC9_ 1
#define _QUADSPI_BK1_IO0_PD11_ 1
#define _QUADSPI_BK1_IO0_PF8_ 1

#define QUADSPI_BK1_IO1_PC10_ PC10,GPIO_AF9
#define QUADSPI_BK1_IO1_PD12_ PD12,GPIO_AF9
#define QUADSPI_BK1_IO1_PF9_ PF9,GPIO_AF10
#define _QUADSPI_BK1_IO1_PC10_ 1
#define _QUADSPI_BK1_IO1_PD12_ 1
#define _QUADSPI_BK1_IO1_PF9_ 1

#define QUADSPI_BK1_IO2_PE2_ PE2,GPIO_AF9
#define QUADSPI_BK1_IO2_PF7_ PF7,GPIO_AF9
#define _QUADSPI_BK1_IO2_PE2_ 1
#define _QUADSPI_BK1_IO2_PF7_ 1

#define QUADSPI_BK1_IO3_PA1_ PA1,GPIO_AF9
#define QUADSPI_BK1_IO3_PD13_ PD13,GPIO_AF9
#define QUADSPI_BK1_IO3_PF6_ PF6,GPIO_AF9
#define _QUADSPI_BK1_IO3_PA1_ 1
#define _QUADSPI_BK1_IO3_PD13_ 1
#define _QUADSPI_BK1_IO3_PF6_ 1

#define QUADSPI_BK1_NCS_PB10_ PB10,GPIO_AF9
#define QUADSPI_BK1_NCS_PB6_ PB6,GPIO_AF10
#define _QUADSPI_BK1_NCS_PB10_ 1
#define _QUADSPI_BK1_NCS_PB6_ 1

#define QUADSPI_BK2_IO0_PE7_ PE7,GPIO_AF10
#define QUADSPI_BK2_IO0_PH2_ PH2,GPIO_AF9
#define _QUADSPI_BK2_IO0_PE7_ 1
#define _QUADSPI_BK2_IO0_PH2_ 1

#define QUADSPI_BK2_IO1_PE8_ PE8,GPIO_AF10
#define QUADSPI_BK2_IO1_PH3_ PH3,GPIO_AF9
#define _QUADSPI_BK2_IO1_PE8_ 1
#define _QUADSPI_BK2_IO1_PH3_ 1

#define QUADSPI_BK2_IO2_PE9_ PE9,GPIO_AF10
#define QUADSPI_BK2_IO2_PG10_ PG10,GPIO_AF11
#define QUADSPI_BK2_IO2_PG9_ PG9,GPIO_AF9
#define _QUADSPI_BK2_IO2_PE9_ 1
#define _QUADSPI_BK2_IO2_PG10_ 1
#define _QUADSPI_BK2_IO2_PG9_ 1

#define QUADSPI_BK2_IO3_PE10_ PE10,GPIO_AF10
#define QUADSPI_BK2_IO3_PG14_ PG14,GPIO_AF9
#define QUADSPI_BK2_IO3_PG7_ PG7,GPIO_AF11
#define _QUADSPI_BK2_IO3_PE10_ 1
#define _QUADSPI_BK2_IO3_PG14_ 1
#define _QUADSPI_BK2_IO3_PG7_ 1

