susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
#define QUADSPI_BK2_NCS_PC0_ PC0,GPIO_AF10
#define QUADSPI_BK2_NCS_PC11_ PC11,GPIO_AF9
#define _QUADSPI_BK2_NCS_PC0_ 1
#define _QUADSPI_BK2_NCS_PC11_ 1

#define QUADSPI_CLK_PA7_ PA7,GPIO_AF10
#define QUADSPI_CLK_PB2_ PB2,GPIO_AF9
#define QUADSPI_CLK_PF10_ PF10,GPIO_AF9
#define QUADSPI_CLK_PG7_ PG7,GPIO_AF9
#define _QUADSPI_CLK_PA7_ 1
#define _QUADSPI_CLK_PB2_ 1
#define _QUADSPI_CLK_PF10_ 1
#define _QUADSPI_CLK_PG7_ 1

#define RCC_MCO_1_PA13_ PA13,GPIO_AF2
#define RCC_MCO_1_PA8_ PA8,GPIO_AF0
#define RCC_MCO_1_PI11_ PI11,GPIO_AF0
#define _RCC_MCO_1_PA13_ 1
#define _RCC_MCO_1_PA8_ 1
#define _RCC_MCO_1_PI11_ 1

#define RCC_MCO_2_PA14_ PA14,GPIO_AF2
#define RCC_MCO_2_PC12_ PC12,GPIO_AF1
#define RCC_MCO_2_PG2_ PG2,GPIO_AF1
#define _RCC_MCO_2_PA14_ 1
#define _RCC_MCO_2_PC12_ 1
#define _RCC_MCO_2_PG2_ 1

#define RTC_OUT2_PB2_ PB2,GPIO_AF1
#define _RTC_OUT2_PB2_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define RTC_REFIN_PD10_ PD10,GPIO_AF0
#define _RTC_REFIN_PB15_ 1
#define _RTC_REFIN_PD10_ 1

#define SAI1_CK1_PE2_ PE2,GPIO_AF2
#define _SAI1_CK1_PE2_ 1

#define SAI1_CK2_PE5_ PE5,GPIO_AF2
#define SAI1_CK2_PG13_ PG13,GPIO_AF2
#define _SAI1_CK2_PE5_ 1
#define _SAI1_CK2_PG13_ 1

#define SAI1_D1_PB2_ PB2,GPIO_AF2
#define SAI1_D1_PC1_ PC1,GPIO_AF2
#define SAI1_D1_PD6_ PD6,GPIO_AF2
#define SAI1_D1_PE6_ PE6,GPIO_AF2
#define _SAI1_D1_PB2_ 1
#define _SAI1_D1_PC1_ 1
#define _SAI1_D1_PD6_ 1
#define _SAI1_D1_PE6_ 1

#define SAI1_D2_PE4_ PE4,GPIO_AF2
#define SAI1_D2_PG15_ PG15,GPIO_AF2
#define _SAI1_D2_PE4_ 1
#define _SAI1_D2_PG15_ 1

#define SAI1_D3_PC5_ PC5,GPIO_AF2
#define SAI1_D3_PF10_ PF10,GPIO_AF2
#define _SAI1_D3_PC5_ 1
#define _SAI1_D3_PF10_ 1

#define SAI1_D4_PC5_ PC5,GPIO_AF6
#define SAI1_D4_PF10_ PF10,GPIO_AF6
#define _SAI1_D4_PC5_ 1
#define _SAI1_D4_PF10_ 1

#define SAI1_FS_A_PE4_ PE4,GPIO_AF6
#define SAI1_FS_A_PG15_ PG15,GPIO_AF6
#define _SAI1_FS_A_PE4_ 1
#define _SAI1_FS_A_PG15_ 1

#define SAI1_FS_B_PF9_ PF9,GPIO_AF6
#define _SAI1_FS_B_PF9_ 1

#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF6
#define SAI1_MCLK_A_PG7_ PG7,GPIO_AF6
#define _SAI1_MCLK_A_PE2_ 1
#define _SAI1_MCLK_A_PG7_ 1

#define SAI1_MCLK_B_PF7_ PF7,GPIO_AF6
#define _SAI1_MCLK_B_PF7_ 1

#define SAI1_SCK_A_PE5_ PE5,GPIO_AF6
#define SAI1_SCK_A_PG13_ PG13,GPIO_AF6
#define _SAI1_SCK_A_PE5_ 1
#define _SAI1_SCK_A_PG13_ 1

#define SAI1_SCK_B_PF8_ PF8,GPIO_AF6
#define _SAI1_SCK_B_PF8_ 1

#define SAI1_SD_A_PB2_ PB2,GPIO_AF6
#define SAI1_SD_A_PC1_ PC1,GPIO_AF6
#define SAI1_SD_A_PD6_ PD6,GPIO_AF6
#define SAI1_SD_A_PE6_ PE6,GPIO_AF6
#define _SAI1_SD_A_PB2_ 1
#define _SAI1_SD_A_PC1_ 1
#define _SAI1_SD_A_PD6_ 1
#define _SAI1_SD_A_PE6_ 1

#define SAI1_SD_B_PE3_ PE3,GPIO_AF6
#define SAI1_SD_B_PF6_ PF6,GPIO_AF6
#define _SAI1_SD_B_PE3_ 1
#define _SAI1_SD_B_PF6_ 1

#define SAI2_FS_A_PD12_ PD12,GPIO_AF10
#define SAI2_FS_A_PI7_ PI7,GPIO_AF10
#define _SAI2_FS_A_PD12_ 1
#define _SAI2_FS_A_PI7_ 1

#define SAI2_FS_B_PA12_ PA12,GPIO_AF8
#define SAI2_FS_B_PC0_ PC0,GPIO_AF8
#define SAI2_FS_B_PE13_ PE13,GPIO_AF10
#define SAI2_FS_B_PG9_ PG9,GPIO_AF10
#define _SAI2_FS_B_PA12_ 1
#define _SAI2_FS_B_PC0_ 1
#define _SAI2_FS_B_PE13_ 1
#define _SAI2_FS_B_PG9_ 1

#define SAI2_MCLK_A_PE0_ PE0,GPIO_AF10
#define SAI2_MCLK_A_PI4_ PI4,GPIO_AF10
#define _SAI2_MCLK_A_PE0_ 1
#define _SAI2_MCLK_A_PI4_ 1

#define SAI2_MCLK_B_PA1_ PA1,GPIO_AF10
#define SAI2_MCLK_B_PE14_ PE14,GPIO_AF10
#define SAI2_MCLK_B_PE6_ PE6,GPIO_AF10
#define SAI2_MCLK_B_PH3_ PH3,GPIO_AF10
#define _SAI2_MCLK_B_PA1_ 1
#define _SAI2_MCLK_B_PE14_ 1
#define _SAI2_MCLK_B_PE6_ 1
#define _SAI2_MCLK_B_PH3_ 1

#define SAI2_SCK_A_PD13_ PD13,GPIO_AF10
#define SAI2_SCK_A_PI5_ PI5,GPIO_AF10
#define _SAI2_SCK_A_PD13_ 1
#define _SAI2_SCK_A_PI5_ 1

#define SAI2_SCK_B_PA2_ PA2,GPIO_AF8
#define SAI2_SCK_B_PE12_ PE12,GPIO_AF10
#define SAI2_SCK_B_PH2_ PH2,GPIO_AF10
#define _SAI2_SCK_B_PA2_ 1
#define _SAI2_SCK_B_PE12_ 1
#define _SAI2_SCK_B_PH2_ 1

#define SAI2_SD_A_PD11_ PD11,GPIO_AF10
#define SAI2_SD_A_PI6_ PI6,GPIO_AF10
#define _SAI2_SD_A_PD11_ 1
#define _SAI2_SD_A_PI6_ 1

#define SAI2_SD_B_PA0_ PA0,GPIO_AF10
#define SAI2_SD_B_PE11_ PE11,GPIO_AF10
#define SAI2_SD_B_PF11_ PF11,GPIO_AF10
#define SAI2_SD_B_PG10_ PG10,GPIO_AF10
#define _SAI2_SD_B_PA0_ 1
#define _SAI2_SD_B_PE11_ 1
#define _SAI2_SD_B_PF11_ 1
#define _SAI2_SD_B_PG10_ 1

#define SAI3_FS_A_PD4_ PD4,GPIO_AF6
#define _SAI3_FS_A_PD4_ 1

#define SAI3_FS_B_PD10_ PD10,GPIO_AF6
#define _SAI3_FS_B_PD10_ 1

#define SAI3_MCLK_A_PD15_ PD15,GPIO_AF6
#define _SAI3_MCLK_A_PD15_ 1

#define SAI3_MCLK_B_PD14_ PD14,GPIO_AF6
#define _SAI3_MCLK_B_PD14_ 1

#define SAI3_SCK_A_PD0_ PD0,GPIO_AF6
#define _SAI3_SCK_A_PD0_ 1

#define SAI3_SCK_B_PD8_ PD8,GPIO_AF6
#define _SAI3_SCK_B_PD8_ 1

#define SAI3_SD_A_PD1_ PD1,GPIO_AF6
#define _SAI3_SD_A_PD1_ 1

#define SAI3_SD_B_PD9_ PD9,GPIO_AF6
#define SAI3_SD_B_PE1_ PE1,GPIO_AF6
#define _SAI3_SD_B_PD9_ 1
#define _SAI3_SD_B_PE1_ 1

#define SAI4_CK1_PA5_ PA5,GPIO_AF4
#define SAI4_CK1_PB3_ PB3,GPIO_AF4
#define SAI4_CK1_PG13_ PG13,GPIO_AF4
#define _SAI4_CK1_PA5_ 1
#define _SAI4_CK1_PB3_ 1
#define _SAI4_CK1_PG13_ 1

#define SAI4_CK2_PA6_ PA6,GPIO_AF4
#define SAI4_CK2_PB4_ PB4,GPIO_AF4
#define SAI4_CK2_PG12_ PG12,GPIO_AF6
#define _SAI4_CK2_PA6_ 1
#define _SAI4_CK2_PB4_ 1
#define _SAI4_CK2_PG12_ 1

#define SAI4_D1_PA7_ PA7,GPIO_AF4
#define SAI4_D1_PB5_ PB5,GPIO_AF3
#define SAI4_D1_PG14_ PG14,GPIO_AF6
#define _SAI4_D1_PA7_ 1
#define _SAI4_D1_PB5_ 1
#define _SAI4_D1_PG14_ 1

#define SAI4_D2_PA15_ PA15,GPIO_AF2
#define SAI4_D2_PA4_ PA4,GPIO_AF4
#define SAI4_D2_PG8_ PG8,GPIO_AF6
#define _SAI4_D2_PA15_ 1
#define _SAI4_D2_PA4_ 1
#define _SAI4_D2_PG8_ 1

#define SAI4_D3_PC12_ PC12,GPIO_AF2
#define SAI4_D3_PC5_ PC5,GPIO_AF12
#define SAI4_D3_PF10_ PF10,GPIO_AF12
#define _SAI4_D3_PC12_ 1
#define _SAI4_D3_PC5_ 1
#define _SAI4_D3_PF10_ 1

#define SAI4_D4_PC5_ PC5,GPIO_AF4
#define SAI4_D4_PF10_ PF10,GPIO_AF3
#define _SAI4_D4_PC5_ 1
#define _SAI4_D4_PF10_ 1

#define SAI4_FS_A_PA15_ PA15,GPIO_AF12
#define SAI4_FS_A_PA4_ PA4,GPIO_AF12
#define SAI4_FS_A_PG8_ PG8,GPIO_AF10
#define _SAI4_FS_A_PA15_ 1
#define _SAI4_FS_A_PA4_ 1
#define _SAI4_FS_A_PG8_ 1

#define SAI4_FS_B_PA10_ PA10,GPIO_AF12
#define _SAI4_FS_B_PA10_ 1

#define SAI4_MCLK_A_PA5_ PA5,GPIO_AF12
#define SAI4_MCLK_A_PB3_ PB3,GPIO_AF12
#define SAI4_MCLK_A_PG13_ PG13,GPIO_AF10
#define _SAI4_MCLK_A_PA5_ 1
#define _SAI4_MCLK_A_PB3_ 1
#define _SAI4_MCLK_A_PG13_ 1

