susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
#define SAI4_MCLK_B_PC10_ PC10,GPIO_AF10
#define SAI4_MCLK_B_PE0_ PE0,GPIO_AF6
#define _SAI4_MCLK_B_PC10_ 1
#define _SAI4_MCLK_B_PE0_ 1

#define SAI4_SCK_A_PA6_ PA6,GPIO_AF12
#define SAI4_SCK_A_PB4_ PB4,GPIO_AF12
#define SAI4_SCK_A_PG12_ PG12,GPIO_AF10
#define _SAI4_SCK_A_PA6_ 1
#define _SAI4_SCK_A_PB4_ 1
#define _SAI4_SCK_A_PG12_ 1

#define SAI4_SCK_B_PC11_ PC11,GPIO_AF10
#define SAI4_SCK_B_PF6_ PF6,GPIO_AF12
#define _SAI4_SCK_B_PC11_ 1
#define _SAI4_SCK_B_PF6_ 1

#define SAI4_SD_A_PA7_ PA7,GPIO_AF12
#define SAI4_SD_A_PB5_ PB5,GPIO_AF10
#define SAI4_SD_A_PG14_ PG14,GPIO_AF10
#define _SAI4_SD_A_PA7_ 1
#define _SAI4_SD_A_PB5_ 1
#define _SAI4_SD_A_PG14_ 1

#define SAI4_SD_B_PA8_ PA8,GPIO_AF12
#define SAI4_SD_B_PC12_ PC12,GPIO_AF10
#define SAI4_SD_B_PH5_ PH5,GPIO_AF12
#define _SAI4_SD_B_PA8_ 1
#define _SAI4_SD_B_PC12_ 1
#define _SAI4_SD_B_PH5_ 1

#define SDMMC1_CDIR_PA15_ PA15,GPIO_AF3
#define SDMMC1_CDIR_PB9_ PB9,GPIO_AF11
#define _SDMMC1_CDIR_PA15_ 1
#define _SDMMC1_CDIR_PB9_ 1

#define SDMMC1_CK_PC12_ PC12,GPIO_AF12
#define _SDMMC1_CK_PC12_ 1

#define SDMMC1_CKIN_PB8_ PB8,GPIO_AF5
#define SDMMC1_CKIN_PE4_ PE4,GPIO_AF8
#define _SDMMC1_CKIN_PB8_ 1
#define _SDMMC1_CKIN_PE4_ 1

#define SDMMC1_CMD_PD2_ PD2,GPIO_AF12
#define _SDMMC1_CMD_PD2_ 1

#define SDMMC1_D0_PC8_ PC8,GPIO_AF12
#define _SDMMC1_D0_PC8_ 1

#define SDMMC1_D0DIR_PC6_ PC6,GPIO_AF8
#define SDMMC1_D0DIR_PE12_ PE12,GPIO_AF8
#define SDMMC1_D0DIR_PE5_ PE5,GPIO_AF8
#define SDMMC1_D0DIR_PF2_ PF2,GPIO_AF11
#define _SDMMC1_D0DIR_PC6_ 1
#define _SDMMC1_D0DIR_PE12_ 1
#define _SDMMC1_D0DIR_PE5_ 1
#define _SDMMC1_D0DIR_PF2_ 1

#define SDMMC1_D1_PC9_ PC9,GPIO_AF12
#define _SDMMC1_D1_PC9_ 1

#define SDMMC1_D123DIR_PC7_ PC7,GPIO_AF8
#define SDMMC1_D123DIR_PD3_ PD3,GPIO_AF8
#define SDMMC1_D123DIR_PE14_ PE14,GPIO_AF11
#define _SDMMC1_D123DIR_PC7_ 1
#define _SDMMC1_D123DIR_PD3_ 1
#define _SDMMC1_D123DIR_PE14_ 1

#define SDMMC1_D2_PC10_ PC10,GPIO_AF12
#define SDMMC1_D2_PE6_ PE6,GPIO_AF8
#define _SDMMC1_D2_PC10_ 1
#define _SDMMC1_D2_PE6_ 1

#define SDMMC1_D3_PC11_ PC11,GPIO_AF12
#define _SDMMC1_D3_PC11_ 1

#define SDMMC1_D4_PB8_ PB8,GPIO_AF12
#define SDMMC1_D4_PE4_ PE4,GPIO_AF11
#define _SDMMC1_D4_PB8_ 1
#define _SDMMC1_D4_PE4_ 1

#define SDMMC1_D5_PA15_ PA15,GPIO_AF11
#define SDMMC1_D5_PB9_ PB9,GPIO_AF12
#define _SDMMC1_D5_PA15_ 1
#define _SDMMC1_D5_PB9_ 1

#define SDMMC1_D6_PC6_ PC6,GPIO_AF12
#define SDMMC1_D6_PE5_ PE5,GPIO_AF11
#define _SDMMC1_D6_PC6_ 1
#define _SDMMC1_D6_PE5_ 1

#define SDMMC1_D7_PC7_ PC7,GPIO_AF12
#define SDMMC1_D7_PD3_ PD3,GPIO_AF11
#define _SDMMC1_D7_PC7_ 1
#define _SDMMC1_D7_PD3_ 1

#define SDMMC2_CDIR_PA15_ PA15,GPIO_AF10
#define SDMMC2_CDIR_PA9_ PA9,GPIO_AF8
#define SDMMC2_CDIR_PB9_ PB9,GPIO_AF7
#define _SDMMC2_CDIR_PA15_ 1
#define _SDMMC2_CDIR_PA9_ 1
#define _SDMMC2_CDIR_PB9_ 1

#define SDMMC2_CK_PC1_ PC1,GPIO_AF9
#define SDMMC2_CK_PE3_ PE3,GPIO_AF9
#define _SDMMC2_CK_PC1_ 1
#define _SDMMC2_CK_PE3_ 1

#define SDMMC2_CKIN_PA8_ PA8,GPIO_AF8
#define SDMMC2_CKIN_PB8_ PB8,GPIO_AF7
#define SDMMC2_CKIN_PE4_ PE4,GPIO_AF7
#define _SDMMC2_CKIN_PA8_ 1
#define _SDMMC2_CKIN_PB8_ 1
#define _SDMMC2_CKIN_PE4_ 1

#define SDMMC2_CMD_PA0_ PA0,GPIO_AF9
#define SDMMC2_CMD_PG6_ PG6,GPIO_AF10
#define _SDMMC2_CMD_PA0_ 1
#define _SDMMC2_CMD_PG6_ 1

#define SDMMC2_D0_PB14_ PB14,GPIO_AF9
#define SDMMC2_D0_PE6_ PE6,GPIO_AF7
#define _SDMMC2_D0_PB14_ 1
#define _SDMMC2_D0_PE6_ 1

#define SDMMC2_D0DIR_PA2_ PA2,GPIO_AF10
#define SDMMC2_D0DIR_PC6_ PC6,GPIO_AF9
#define SDMMC2_D0DIR_PE5_ PE5,GPIO_AF7
#define SDMMC2_D0DIR_PF2_ PF2,GPIO_AF9
#define _SDMMC2_D0DIR_PA2_ 1
#define _SDMMC2_D0DIR_PC6_ 1
#define _SDMMC2_D0DIR_PE5_ 1
#define _SDMMC2_D0DIR_PF2_ 1

#define SDMMC2_D1_PB15_ PB15,GPIO_AF9
#define SDMMC2_D1_PB7_ PB7,GPIO_AF10
#define _SDMMC2_D1_PB15_ 1
#define _SDMMC2_D1_PB7_ 1

#define SDMMC2_D123DIR_PC7_ PC7,GPIO_AF9
#define SDMMC2_D123DIR_PD3_ PD3,GPIO_AF10
#define _SDMMC2_D123DIR_PC7_ 1
#define _SDMMC2_D123DIR_PD3_ 1

#define SDMMC2_D2_PB3_ PB3,GPIO_AF9
#define _SDMMC2_D2_PB3_ 1

#define SDMMC2_D3_PB4_ PB4,GPIO_AF9
#define _SDMMC2_D3_PB4_ 1

#define SDMMC2_D4_PA8_ PA8,GPIO_AF9
#define SDMMC2_D4_PB8_ PB8,GPIO_AF10
#define SDMMC2_D4_PE4_ PE4,GPIO_AF9
#define _SDMMC2_D4_PA8_ 1
#define _SDMMC2_D4_PB8_ 1
#define _SDMMC2_D4_PE4_ 1

#define SDMMC2_D5_PA15_ PA15,GPIO_AF9
#define SDMMC2_D5_PA9_ PA9,GPIO_AF10
#define SDMMC2_D5_PB9_ PB9,GPIO_AF10
#define _SDMMC2_D5_PA15_ 1
#define _SDMMC2_D5_PA9_ 1
#define _SDMMC2_D5_PB9_ 1

#define SDMMC2_D6_PC6_ PC6,GPIO_AF10
#define SDMMC2_D6_PE5_ PE5,GPIO_AF9
#define _SDMMC2_D6_PC6_ 1
#define _SDMMC2_D6_PE5_ 1

#define SDMMC2_D7_PC7_ PC7,GPIO_AF10
#define SDMMC2_D7_PD3_ PD3,GPIO_AF9
#define _SDMMC2_D7_PC7_ 1
#define _SDMMC2_D7_PD3_ 1

#define SDMMC3_CDIR_PF1_ PF1,GPIO_AF10
#define _SDMMC3_CDIR_PF1_ 1

#define SDMMC3_CK_PG15_ PG15,GPIO_AF10
#define _SDMMC3_CK_PG15_ 1

#define SDMMC3_CKIN_PF0_ PF0,GPIO_AF10
#define _SDMMC3_CKIN_PF0_ 1

#define SDMMC3_CMD_PD0_ PD0,GPIO_AF10
#define SDMMC3_CMD_PF1_ PF1,GPIO_AF9
#define _SDMMC3_CMD_PD0_ 1
#define _SDMMC3_CMD_PF1_ 1

#define SDMMC3_D0_PD1_ PD1,GPIO_AF10
#define SDMMC3_D0_PF0_ PF0,GPIO_AF9
#define _SDMMC3_D0_PD1_ 1
#define _SDMMC3_D0_PF0_ 1

#define SDMMC3_D0DIR_PF2_ PF2,GPIO_AF10
#define _SDMMC3_D0DIR_PF2_ 1

#define SDMMC3_D1_PD4_ PD4,GPIO_AF10
#define SDMMC3_D1_PF4_ PF4,GPIO_AF9
#define _SDMMC3_D1_PD4_ 1
#define _SDMMC3_D1_PF4_ 1

#define SDMMC3_D123DIR_PF4_ PF4,GPIO_AF10
#define _SDMMC3_D123DIR_PF4_ 1

#define SDMMC3_D2_PD5_ PD5,GPIO_AF10
#define SDMMC3_D2_PF5_ PF5,GPIO_AF9
#define _SDMMC3_D2_PD5_ 1
#define _SDMMC3_D2_PF5_ 1

#define SDMMC3_D3_PD7_ PD7,GPIO_AF10
#define _SDMMC3_D3_PD7_ 1

#define SPDIFRX_IN0_PD7_ PD7,GPIO_AF9
#define SPDIFRX_IN0_PG11_ PG11,GPIO_AF8
#define _SPDIFRX_IN0_PD7_ 1
#define _SPDIFRX_IN0_PG11_ 1

#define SPDIFRX_IN1_PD8_ PD8,GPIO_AF9
#define SPDIFRX_IN1_PG12_ PG12,GPIO_AF8
#define _SPDIFRX_IN1_PD8_ 1
#define _SPDIFRX_IN1_PG12_ 1

#define SPDIFRX_IN2_PC4_ PC4,GPIO_AF9
#define SPDIFRX_IN2_PG8_ PG8,GPIO_AF9
#define _SPDIFRX_IN2_PC4_ 1
#define _SPDIFRX_IN2_PG8_ 1

#define SPDIFRX_IN3_PC5_ PC5,GPIO_AF9
#define SPDIFRX_IN3_PG9_ PG9,GPIO_AF8
#define _SPDIFRX_IN3_PC5_ 1
#define _SPDIFRX_IN3_PG9_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define SPI1_MISO_PZ1_ PZ1,GPIO_AF5
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1
#define _SPI1_MISO_PZ1_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define SPI1_MOSI_PZ2_ PZ2,GPIO_AF5
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PZ2_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PZ3_ PZ3,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PZ3_ 1

