susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define SPI1_SCK_PZ0_ PZ0,GPIO_AF5
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1
#define _SPI1_SCK_PZ0_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define SPI2_MISO_PI2_ PI2,GPIO_AF5
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PI2_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC1_ PC1,GPIO_AF5
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define SPI2_MOSI_PI3_ PI3,GPIO_AF5
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC1_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PI3_ 1

#define SPI2_NSS_PA11_ PA11,GPIO_AF5
#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PB4_ PB4,GPIO_AF7
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PI0_ PI0,GPIO_AF5
#define _SPI2_NSS_PA11_ 1
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB4_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PI0_ 1

#define SPI2_SCK_PA9_ PA9,GPIO_AF5
#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PD3_ PD3,GPIO_AF5
#define SPI2_SCK_PI1_ PI1,GPIO_AF5
#define _SPI2_SCK_PA9_ 1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PD3_ 1
#define _SPI2_SCK_PI1_ 1

#define SPI3_MISO_PB4_ PB4,GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define SPI3_MISO_PD10_ PD10,GPIO_AF5
#define _SPI3_MISO_PB4_ 1
#define _SPI3_MISO_PC11_ 1
#define _SPI3_MISO_PD10_ 1

#define SPI3_MOSI_PA8_ PA8,GPIO_AF5
#define SPI3_MOSI_PB2_ PB2,GPIO_AF7
#define SPI3_MOSI_PB5_ PB5,GPIO_AF7
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define SPI3_MOSI_PD6_ PD6,GPIO_AF5
#define _SPI3_MOSI_PA8_ 1
#define _SPI3_MOSI_PB2_ 1
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1
#define _SPI3_MOSI_PD6_ 1

#define SPI3_NSS_PA10_ PA10,GPIO_AF5
#define SPI3_NSS_PA15_ PA15,GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define _SPI3_NSS_PA10_ 1
#define _SPI3_NSS_PA15_ 1
#define _SPI3_NSS_PA4_ 1

#define SPI3_SCK_PB3_ PB3,GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define SPI3_SCK_PE0_ PE0,GPIO_AF5
#define _SPI3_SCK_PB3_ 1
#define _SPI3_SCK_PC10_ 1
#define _SPI3_SCK_PE0_ 1

#define SPI4_MISO_PE13_ PE13,GPIO_AF5
#define SPI4_MISO_PE5_ PE5,GPIO_AF5
#define _SPI4_MISO_PE13_ 1
#define _SPI4_MISO_PE5_ 1

#define SPI4_MOSI_PE14_ PE14,GPIO_AF5
#define SPI4_MOSI_PE6_ PE6,GPIO_AF5
#define _SPI4_MOSI_PE14_ 1
#define _SPI4_MOSI_PE6_ 1

#define SPI4_NSS_PE11_ PE11,GPIO_AF5
#define SPI4_NSS_PE4_ PE4,GPIO_AF5
#define _SPI4_NSS_PE11_ 1
#define _SPI4_NSS_PE4_ 1

#define SPI4_SCK_PE12_ PE12,GPIO_AF5
#define SPI4_SCK_PE2_ PE2,GPIO_AF5
#define _SPI4_SCK_PE12_ 1
#define _SPI4_SCK_PE2_ 1

#define SPI5_MISO_PF8_ PF8,GPIO_AF5
#define SPI5_MISO_PH7_ PH7,GPIO_AF5
#define SPI5_MISO_PJ11_ PJ11,GPIO_AF5
#define _SPI5_MISO_PF8_ 1
#define _SPI5_MISO_PH7_ 1
#define _SPI5_MISO_PJ11_ 1

#define SPI5_MOSI_PF11_ PF11,GPIO_AF5
#define SPI5_MOSI_PF9_ PF9,GPIO_AF5
#define SPI5_MOSI_PJ10_ PJ10,GPIO_AF5
#define _SPI5_MOSI_PF11_ 1
#define _SPI5_MOSI_PF9_ 1
#define _SPI5_MOSI_PJ10_ 1

#define SPI5_NSS_PF6_ PF6,GPIO_AF5
#define SPI5_NSS_PH5_ PH5,GPIO_AF5
#define SPI5_NSS_PK1_ PK1,GPIO_AF5
#define _SPI5_NSS_PF6_ 1
#define _SPI5_NSS_PH5_ 1
#define _SPI5_NSS_PK1_ 1

#define SPI5_SCK_PF7_ PF7,GPIO_AF5
#define SPI5_SCK_PH6_ PH6,GPIO_AF5
#define SPI5_SCK_PK0_ PK0,GPIO_AF5
#define _SPI5_SCK_PF7_ 1
#define _SPI5_SCK_PH6_ 1
#define _SPI5_SCK_PK0_ 1

#define SPI6_MISO_PA6_ PA6,GPIO_AF8
#define SPI6_MISO_PB4_ PB4,GPIO_AF8
#define SPI6_MISO_PG12_ PG12,GPIO_AF5
#define SPI6_MISO_PZ1_ PZ1,GPIO_AF8
#define _SPI6_MISO_PA6_ 1
#define _SPI6_MISO_PB4_ 1
#define _SPI6_MISO_PG12_ 1
#define _SPI6_MISO_PZ1_ 1

#define SPI6_MOSI_PA7_ PA7,GPIO_AF8
#define SPI6_MOSI_PB5_ PB5,GPIO_AF8
#define SPI6_MOSI_PG14_ PG14,GPIO_AF5
#define SPI6_MOSI_PZ2_ PZ2,GPIO_AF8
#define _SPI6_MOSI_PA7_ 1
#define _SPI6_MOSI_PB5_ 1
#define _SPI6_MOSI_PG14_ 1
#define _SPI6_MOSI_PZ2_ 1

#define SPI6_NSS_PA15_ PA15,GPIO_AF7
#define SPI6_NSS_PA4_ PA4,GPIO_AF8
#define SPI6_NSS_PG8_ PG8,GPIO_AF5
#define SPI6_NSS_PZ3_ PZ3,GPIO_AF8
#define _SPI6_NSS_PA15_ 1
#define _SPI6_NSS_PA4_ 1
#define _SPI6_NSS_PG8_ 1
#define _SPI6_NSS_PZ3_ 1

#define SPI6_SCK_PA5_ PA5,GPIO_AF8
#define SPI6_SCK_PB3_ PB3,GPIO_AF8
#define SPI6_SCK_PG13_ PG13,GPIO_AF5
#define SPI6_SCK_PZ0_ PZ0,GPIO_AF8
#define _SPI6_SCK_PA5_ 1
#define _SPI6_SCK_PB3_ 1
#define _SPI6_SCK_PG13_ 1
#define _SPI6_SCK_PZ0_ 1

#define TIM12_CH1_PB14_ PB14,GPIO_AF2
#define TIM12_CH1_PH6_ PH6,GPIO_AF2
#define _TIM12_CH1_PB14_ 1
#define _TIM12_CH1_PH6_ 1

#define TIM12_CH2_PB15_ PB15,GPIO_AF2
#define TIM12_CH2_PH9_ PH9,GPIO_AF2
#define _TIM12_CH2_PB15_ 1
#define _TIM12_CH2_PH9_ 1

#define TIM13_CH1_PA6_ PA6,GPIO_AF9
#define TIM13_CH1_PF8_ PF8,GPIO_AF9
#define _TIM13_CH1_PA6_ 1
#define _TIM13_CH1_PF8_ 1

#define TIM14_CH1_PA7_ PA7,GPIO_AF9
#define TIM14_CH1_PF9_ PF9,GPIO_AF9
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PF9_ 1

#define TIM15_BKIN_PA0_ PA0,GPIO_AF4
#define TIM15_BKIN_PE15_ PE15,GPIO_AF4
#define TIM15_BKIN_PE3_ PE3,GPIO_AF4
#define _TIM15_BKIN_PA0_ 1
#define _TIM15_BKIN_PE15_ 1
#define _TIM15_BKIN_PE3_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF4
#define TIM15_CH1_PE5_ PE5,GPIO_AF4
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PE5_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF4
#define TIM15_CH1N_PE4_ PE4,GPIO_AF4
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PE4_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF4
#define TIM15_CH2_PE6_ PE6,GPIO_AF4
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PE6_ 1

#define TIM16_BKIN_PB4_ PB4,GPIO_AF1
#define TIM16_BKIN_PD10_ PD10,GPIO_AF1
#define TIM16_BKIN_PF10_ PF10,GPIO_AF1
#define _TIM16_BKIN_PB4_ 1
#define _TIM16_BKIN_PD10_ 1
#define _TIM16_BKIN_PF10_ 1

#define TIM16_CH1_PB8_ PB8,GPIO_AF1
#define TIM16_CH1_PF6_ PF6,GPIO_AF1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PF6_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF1
#define TIM16_CH1N_PD6_ PD6,GPIO_AF1
#define TIM16_CH1N_PF8_ PF8,GPIO_AF1
#define _TIM16_CH1N_PB6_ 1
#define _TIM16_CH1N_PD6_ 1
#define _TIM16_CH1N_PF8_ 1

#define TIM17_BKIN_PB5_ PB5,GPIO_AF1
#define TIM17_BKIN_PG6_ PG6,GPIO_AF1
#define _TIM17_BKIN_PB5_ 1
#define _TIM17_BKIN_PG6_ 1

