susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
#define TIM17_CH1_PB9_ PB9,GPIO_AF1
#define TIM17_CH1_PF7_ PF7,GPIO_AF1
#define _TIM17_CH1_PB9_ 1
#define _TIM17_CH1_PF7_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF1
#define TIM17_CH1N_PF9_ PF9,GPIO_AF1
#define _TIM17_CH1N_PB7_ 1
#define _TIM17_CH1N_PF9_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF1
#define TIM1_BKIN_PB12_ PB12,GPIO_AF1
#define TIM1_BKIN_PE15_ PE15,GPIO_AF1
#define TIM1_BKIN_PK2_ PK2,GPIO_AF1
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PE15_ 1
#define _TIM1_BKIN_PK2_ 1

#define TIM1_BKIN2_PE6_ PE6,GPIO_AF1
#define TIM1_BKIN2_PG4_ PG4,GPIO_AF1
#define _TIM1_BKIN2_PE6_ 1
#define _TIM1_BKIN2_PG4_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define TIM1_CH1_PE9_ PE9,GPIO_AF1
#define TIM1_CH1_PK1_ PK1,GPIO_AF1
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PE9_ 1
#define _TIM1_CH1_PK1_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define TIM1_CH1N_PB13_ PB13,GPIO_AF1
#define TIM1_CH1N_PE8_ PE8,GPIO_AF1
#define TIM1_CH1N_PK0_ PK0,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PE8_ 1
#define _TIM1_CH1N_PK0_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define TIM1_CH2_PE11_ PE11,GPIO_AF1
#define TIM1_CH2_PJ11_ PJ11,GPIO_AF1
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PE11_ 1
#define _TIM1_CH2_PJ11_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF1
#define TIM1_CH2N_PB14_ PB14,GPIO_AF1
#define TIM1_CH2N_PE10_ PE10,GPIO_AF1
#define TIM1_CH2N_PJ10_ PJ10,GPIO_AF1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PE10_ 1
#define _TIM1_CH2N_PJ10_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define TIM1_CH3_PE13_ PE13,GPIO_AF1
#define TIM1_CH3_PJ9_ PJ9,GPIO_AF1
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PE13_ 1
#define _TIM1_CH3_PJ9_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF1
#define TIM1_CH3N_PB15_ PB15,GPIO_AF1
#define TIM1_CH3N_PE12_ PE12,GPIO_AF1
#define TIM1_CH3N_PJ8_ PJ8,GPIO_AF1
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PE12_ 1
#define _TIM1_CH3N_PJ8_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define TIM1_CH4_PE14_ PE14,GPIO_AF1
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PE14_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define TIM1_ETR_PE7_ PE7,GPIO_AF1
#define TIM1_ETR_PG5_ PG5,GPIO_AF1
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PE7_ 1
#define _TIM1_ETR_PG5_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define TIM2_CH1_PG8_ PG8,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1
#define _TIM2_CH1_PG8_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF1
#define TIM2_ETR_PA15_ PA15,GPIO_AF1
#define TIM2_ETR_PA5_ PA5,GPIO_AF1
#define TIM2_ETR_PG8_ PG8,GPIO_AF1
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1
#define _TIM2_ETR_PG8_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF2
#define TIM3_CH1_PB4_ PB4,GPIO_AF2
#define TIM3_CH1_PC6_ PC6,GPIO_AF2
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF2
#define TIM3_CH2_PB5_ PB5,GPIO_AF2
#define TIM3_CH2_PC7_ PC7,GPIO_AF2
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF2
#define TIM3_CH3_PC8_ PC8,GPIO_AF2
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF2
#define TIM3_CH4_PC9_ PC9,GPIO_AF2
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PC9_ 1

#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define TIM3_ETR_PE7_ PE7,GPIO_AF2
#define _TIM3_ETR_PD2_ 1
#define _TIM3_ETR_PE7_ 1

#define TIM4_CH1_PB6_ PB6,GPIO_AF2
#define TIM4_CH1_PD12_ PD12,GPIO_AF2
#define _TIM4_CH1_PB6_ 1
#define _TIM4_CH1_PD12_ 1

#define TIM4_CH2_PB7_ PB7,GPIO_AF2
#define TIM4_CH2_PD13_ PD13,GPIO_AF2
#define _TIM4_CH2_PB7_ 1
#define _TIM4_CH2_PD13_ 1

#define TIM4_CH3_PB8_ PB8,GPIO_AF2
#define TIM4_CH3_PD14_ PD14,GPIO_AF2
#define _TIM4_CH3_PB8_ 1
#define _TIM4_CH3_PD14_ 1

#define TIM4_CH4_PB9_ PB9,GPIO_AF2
#define TIM4_CH4_PD15_ PD15,GPIO_AF2
#define _TIM4_CH4_PB9_ 1
#define _TIM4_CH4_PD15_ 1

#define TIM4_ETR_PE0_ PE0,GPIO_AF2
#define _TIM4_ETR_PE0_ 1

#define TIM5_CH1_PA0_ PA0,GPIO_AF2
#define TIM5_CH1_PH10_ PH10,GPIO_AF2
#define _TIM5_CH1_PA0_ 1
#define _TIM5_CH1_PH10_ 1

#define TIM5_CH2_PA1_ PA1,GPIO_AF2
#define TIM5_CH2_PH11_ PH11,GPIO_AF2
#define _TIM5_CH2_PA1_ 1
#define _TIM5_CH2_PH11_ 1

#define TIM5_CH3_PA2_ PA2,GPIO_AF2
#define TIM5_CH3_PH12_ PH12,GPIO_AF2
#define _TIM5_CH3_PA2_ 1
#define _TIM5_CH3_PH12_ 1

#define TIM5_CH4_PA3_ PA3,GPIO_AF2
#define TIM5_CH4_PI0_ PI0,GPIO_AF2
#define _TIM5_CH4_PA3_ 1
#define _TIM5_CH4_PI0_ 1

#define TIM5_ETR_PA4_ PA4,GPIO_AF2
#define TIM5_ETR_PH8_ PH8,GPIO_AF2
#define _TIM5_ETR_PA4_ 1
#define _TIM5_ETR_PH8_ 1

#define TIM8_BKIN_PA6_ PA6,GPIO_AF3
#define TIM8_BKIN_PG2_ PG2,GPIO_AF3
#define TIM8_BKIN_PI4_ PI4,GPIO_AF3
#define TIM8_BKIN_PK2_ PK2,GPIO_AF3
#define _TIM8_BKIN_PA6_ 1
#define _TIM8_BKIN_PG2_ 1
#define _TIM8_BKIN_PI4_ 1
#define _TIM8_BKIN_PK2_ 1

#define TIM8_BKIN2_PA8_ PA8,GPIO_AF3
#define TIM8_BKIN2_PG3_ PG3,GPIO_AF3
#define TIM8_BKIN2_PI1_ PI1,GPIO_AF3
#define _TIM8_BKIN2_PA8_ 1
#define _TIM8_BKIN2_PG3_ 1
#define _TIM8_BKIN2_PI1_ 1

#define TIM8_CH1_PC6_ PC6,GPIO_AF3
#define TIM8_CH1_PI5_ PI5,GPIO_AF3
#define TIM8_CH1_PJ8_ PJ8,GPIO_AF3
#define _TIM8_CH1_PC6_ 1
#define _TIM8_CH1_PI5_ 1
#define _TIM8_CH1_PJ8_ 1

#define TIM8_CH1N_PA5_ PA5,GPIO_AF3
#define TIM8_CH1N_PA7_ PA7,GPIO_AF3
#define TIM8_CH1N_PH13_ PH13,GPIO_AF3
#define TIM8_CH1N_PJ9_ PJ9,GPIO_AF3
#define _TIM8_CH1N_PA5_ 1
#define _TIM8_CH1N_PA7_ 1
#define _TIM8_CH1N_PH13_ 1
#define _TIM8_CH1N_PJ9_ 1

#define TIM8_CH2_PC7_ PC7,GPIO_AF3
#define TIM8_CH2_PI6_ PI6,GPIO_AF3
#define TIM8_CH2_PJ10_ PJ10,GPIO_AF3
#define TIM8_CH2_PJ6_ PJ6,GPIO_AF3
#define _TIM8_CH2_PC7_ 1
#define _TIM8_CH2_PI6_ 1
#define _TIM8_CH2_PJ10_ 1
#define _TIM8_CH2_PJ6_ 1

