susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MPU.h
#define TIM8_CH2N_PB0_ PB0,GPIO_AF3
#define TIM8_CH2N_PB14_ PB14,GPIO_AF3
#define TIM8_CH2N_PH14_ PH14,GPIO_AF3
#define TIM8_CH2N_PJ11_ PJ11,GPIO_AF3
#define TIM8_CH2N_PJ7_ PJ7,GPIO_AF3
#define _TIM8_CH2N_PB0_ 1
#define _TIM8_CH2N_PB14_ 1
#define _TIM8_CH2N_PH14_ 1
#define _TIM8_CH2N_PJ11_ 1
#define _TIM8_CH2N_PJ7_ 1

#define TIM8_CH3_PC8_ PC8,GPIO_AF3
#define TIM8_CH3_PI7_ PI7,GPIO_AF3
#define TIM8_CH3_PK0_ PK0,GPIO_AF3
#define _TIM8_CH3_PC8_ 1
#define _TIM8_CH3_PI7_ 1
#define _TIM8_CH3_PK0_ 1

#define TIM8_CH3N_PB1_ PB1,GPIO_AF3
#define TIM8_CH3N_PB15_ PB15,GPIO_AF3
#define TIM8_CH3N_PH15_ PH15,GPIO_AF3
#define TIM8_CH3N_PK1_ PK1,GPIO_AF3
#define _TIM8_CH3N_PB1_ 1
#define _TIM8_CH3N_PB15_ 1
#define _TIM8_CH3N_PH15_ 1
#define _TIM8_CH3N_PK1_ 1

#define TIM8_CH4_PC9_ PC9,GPIO_AF3
#define TIM8_CH4_PI2_ PI2,GPIO_AF3
#define _TIM8_CH4_PC9_ 1
#define _TIM8_CH4_PI2_ 1

#define TIM8_ETR_PA0_ PA0,GPIO_AF3
#define TIM8_ETR_PG8_ PG8,GPIO_AF3
#define TIM8_ETR_PI3_ PI3,GPIO_AF3
#define _TIM8_ETR_PA0_ 1
#define _TIM8_ETR_PG8_ 1
#define _TIM8_ETR_PI3_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define UART1_CK_PZ0_ PZ0,GPIO_AF7
#define UART1_CK_PZ6_ PZ6,GPIO_AF4
#define _UART1_CK_PA8_ 1
#define _UART1_CK_PZ0_ 1
#define _UART1_CK_PZ6_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define UART1_CTS_PZ3_ PZ3,GPIO_AF7
#define _UART1_CTS_PA11_ 1
#define _UART1_CTS_PZ3_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define UART1_DE_PZ5_ PZ5,GPIO_AF7
#define _UART1_DE_PA12_ 1
#define _UART1_DE_PZ5_ 1

#define UART1_NSS_PA11_ PA11,GPIO_AF7
#define UART1_NSS_PZ3_ PZ3,GPIO_AF7
#define _UART1_NSS_PA11_ 1
#define _UART1_NSS_PZ3_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define UART1_RTS_PZ5_ PZ5,GPIO_AF7
#define _UART1_RTS_PA12_ 1
#define _UART1_RTS_PZ5_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB15_ PB15,GPIO_AF4
#define UART1_RX_PB2_ PB2,GPIO_AF4
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define UART1_RX_PZ1_ PZ1,GPIO_AF7
#define UART1_RX_PZ6_ PZ6,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB15_ 1
#define _UART1_RX_PB2_ 1
#define _UART1_RX_PB7_ 1
#define _UART1_RX_PZ1_ 1
#define _UART1_RX_PZ6_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB14_ PB14,GPIO_AF4
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define UART1_TX_PG11_ PG11,GPIO_AF4
#define UART1_TX_PZ2_ PZ2,GPIO_AF7
#define UART1_TX_PZ7_ PZ7,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB14_ 1
#define _UART1_TX_PB6_ 1
#define _UART1_TX_PG11_ 1
#define _UART1_TX_PZ2_ 1
#define _UART1_TX_PZ7_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define UART2_CK_PD7_ PD7,GPIO_AF7
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PD7_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define UART2_CTS_PD3_ PD3,GPIO_AF7
#define UART2_CTS_PE15_ PE15,GPIO_AF7
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PD3_ 1
#define _UART2_CTS_PE15_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF7
#define UART2_DE_PD4_ PD4,GPIO_AF7
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PD4_ 1

#define UART2_NSS_PA0_ PA0,GPIO_AF7
#define UART2_NSS_PD3_ PD3,GPIO_AF7
#define UART2_NSS_PE15_ PE15,GPIO_AF7
#define _UART2_NSS_PA0_ 1
#define _UART2_NSS_PD3_ 1
#define _UART2_NSS_PE15_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define UART2_RTS_PD4_ PD4,GPIO_AF7
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA3_ PA3,GPIO_AF7
#define UART2_RX_PD6_ PD6,GPIO_AF7
#define UART2_RX_PF4_ PF4,GPIO_AF7
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PD6_ 1
#define _UART2_RX_PF4_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF7
#define UART2_TX_PD5_ PD5,GPIO_AF7
#define UART2_TX_PF5_ PF5,GPIO_AF7
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PD5_ 1
#define _UART2_TX_PF5_ 1

#define UART3_CK_PB12_ PB12,GPIO_AF7
#define UART3_CK_PC12_ PC12,GPIO_AF7
#define UART3_CK_PD10_ PD10,GPIO_AF7
#define _UART3_CK_PB12_ 1
#define _UART3_CK_PC12_ 1
#define _UART3_CK_PD10_ 1

#define UART3_CTS_PB13_ PB13,GPIO_AF7
#define UART3_CTS_PD11_ PD11,GPIO_AF7
#define UART3_CTS_PI10_ PI10,GPIO_AF8
#define _UART3_CTS_PB13_ 1
#define _UART3_CTS_PD11_ 1
#define _UART3_CTS_PI10_ 1

#define UART3_DE_PB14_ PB14,GPIO_AF7
#define UART3_DE_PD12_ PD12,GPIO_AF7
#define UART3_DE_PG8_ PG8,GPIO_AF8
#define _UART3_DE_PB14_ 1
#define _UART3_DE_PD12_ 1
#define _UART3_DE_PG8_ 1

#define UART3_NSS_PB13_ PB13,GPIO_AF7
#define UART3_NSS_PD11_ PD11,GPIO_AF7
#define UART3_NSS_PI10_ PI10,GPIO_AF8
#define _UART3_NSS_PB13_ 1
#define _UART3_NSS_PD11_ 1
#define _UART3_NSS_PI10_ 1

#define UART3_RTS_PB14_ PB14,GPIO_AF7
#define UART3_RTS_PD12_ PD12,GPIO_AF7
#define UART3_RTS_PG8_ PG8,GPIO_AF8
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD12_ 1
#define _UART3_RTS_PG8_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PB12_ PB12,GPIO_AF8
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define UART3_RX_PD9_ PD9,GPIO_AF7
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PB12_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PD9_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PD8_ 1

#define UART4_CTS_PB0_ PB0,GPIO_AF8
#define _UART4_CTS_PB0_ 1

#define UART4_DE_PA15_ PA15,GPIO_AF8
#define _UART4_DE_PA15_ 1

#define UART4_RTS_PA15_ PA15,GPIO_AF8
#define _UART4_RTS_PA15_ 1

#define UART4_RX_PA1_ PA1,GPIO_AF8
#define UART4_RX_PA11_ PA11,GPIO_AF6
#define UART4_RX_PB2_ PB2,GPIO_AF8
#define UART4_RX_PB8_ PB8,GPIO_AF8
#define UART4_RX_PC11_ PC11,GPIO_AF8
#define UART4_RX_PD0_ PD0,GPIO_AF8
#define UART4_RX_PD2_ PD2,GPIO_AF6
#define UART4_RX_PH14_ PH14,GPIO_AF8
#define UART4_RX_PI9_ PI9,GPIO_AF8
#define _UART4_RX_PA1_ 1
#define _UART4_RX_PA11_ 1
#define _UART4_RX_PB2_ 1
#define _UART4_RX_PB8_ 1
#define _UART4_RX_PC11_ 1
#define _UART4_RX_PD0_ 1
#define _UART4_RX_PD2_ 1
#define _UART4_RX_PH14_ 1
#define _UART4_RX_PI9_ 1

#define UART4_TX_PA0_ PA0,GPIO_AF8
#define UART4_TX_PA12_ PA12,GPIO_AF6
#define UART4_TX_PA13_ PA13,GPIO_AF8
#define UART4_TX_PB9_ PB9,GPIO_AF8
#define UART4_TX_PC10_ PC10,GPIO_AF8
#define UART4_TX_PC8_ PC8,GPIO_AF6
#define UART4_TX_PD1_ PD1,GPIO_AF8
#define UART4_TX_PG11_ PG11,GPIO_AF6
#define UART4_TX_PH13_ PH13,GPIO_AF8
#define _UART4_TX_PA0_ 1
#define _UART4_TX_PA12_ 1
#define _UART4_TX_PA13_ 1
#define _UART4_TX_PB9_ 1
#define _UART4_TX_PC10_ 1
#define _UART4_TX_PC8_ 1
#define _UART4_TX_PD1_ 1
#define _UART4_TX_PG11_ 1
#define _UART4_TX_PH13_ 1

